Synwit-Co-Ltd/SWM342_Lib/SWM342_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM342.h
#define QEI_IM_INDEX_Pos 			0
#define QEI_IM_INDEX_Msk			(0x01 << QEI_IM_INDEX_Pos)
#define QEI_IM_MATCH_Pos 			1
#define QEI_IM_MATCH_Msk			(0x01 << QEI_IM_MATCH_Pos)
#define QEI_IM_CNTOV_Pos 			2
#define QEI_IM_CNTOV_Msk			(0x01 << QEI_IM_CNTOV_Pos)
#define QEI_IM_ERROR_Pos 			3
#define QEI_IM_ERROR_Msk			(0x01 << QEI_IM_ERROR_Pos)

#define QEI_IC_INDEX_Pos 			0
#define QEI_IC_INDEX_Msk			(0x01 << QEI_IC_INDEX_Pos)
#define QEI_IC_MATCH_Pos 			1
#define QEI_IC_MATCH_Msk			(0x01 << QEI_IC_MATCH_Pos)
#define QEI_IC_CNTOV_Pos 			2
#define QEI_IC_CNTOV_Msk			(0x01 << QEI_IC_CNTOV_Pos)
#define QEI_IC_ERROR_Pos 			3
#define QEI_IC_ERROR_Msk			(0x01 << QEI_IC_ERROR_Pos)

#define QEI_IF_INDEX_Pos 			0
#define QEI_IF_INDEX_Msk			(0x01 << QEI_IF_INDEX_Pos)
#define QEI_IF_MATCH_Pos 			1
#define QEI_IF_MATCH_Msk			(0x01 << QEI_IF_MATCH_Pos)
#define QEI_IF_CNTOV_Pos 			2
#define QEI_IF_CNTOV_Msk			(0x01 << QEI_IF_CNTOV_Pos)
#define QEI_IF_ERROR_Pos 			3
#define QEI_IF_ERROR_Msk			(0x01 << QEI_IF_ERROR_Pos)

#define QEI_IFOV_INDEX_Pos 			0
#define QEI_IFOV_INDEX_Msk			(0x01 << QEI_IFOV_INDEX_Pos)
#define QEI_IFOV_MATCH_Pos 			1
#define QEI_IFOV_MATCH_Msk			(0x01 << QEI_IFOV_MATCH_Pos)
#define QEI_IFOV_CNTOV_Pos 			2
#define QEI_IFOV_CNTOV_Msk			(0x01 << QEI_IFOV_CNTOV_Pos)
#define QEI_IFOV_ERROR_Pos 			3
#define QEI_IFOV_ERROR_Msk			(0x01 << QEI_IFOV_ERROR_Pos)




typedef struct {
	__IO uint32_t EN;                       //[0] ENABLE
    
	__IO uint32_t IE;                       //只有为1时，IF[CHx]在DMA传输结束时才能变为1，否则将一直保持在0
    
	__IO uint32_t IM;                       //当为1时，即使IF[CHx]为1，dma_int也不会因此变1
    
	__IO uint32_t IF;                       //写1清零
	
	__IO uint32_t DSTIE;					//Destination Interrupt Enable
	
	__IO uint32_t DSTIM;
	
	__IO uint32_t DSTIF;
	
	__IO uint32_t SRCIE;					//Source Interrupt Enable
	
	__IO uint32_t SRCIM;
	
	__IO uint32_t SRCIF;
	
		 uint32_t RESERVED[5];
	
	__IO uint32_t PRI;						//优先级，1 高优先级    0 低优先级
	
	struct {
		__IO uint32_t CR;
		
		__IO uint32_t AM;                   //Adress Mode
		
		__IO uint32_t DST;
		
		__IO uint32_t DSTSGADDR1;			//只在Scatter Gather模式下使用
		
		__IO uint32_t DSTSGADDR2;			//只在Scatter Gather模式下使用
		
		__IO uint32_t DSTSGADDR3;			//只在Scatter Gather模式下使用
		
		__IO uint32_t MUX;
		
		__IO uint32_t SRC;
		
		__IO uint32_t SRCSGADDR1;			//只在Scatter Gather模式下使用
		
		__IO uint32_t SRCSGADDR2;			//只在Scatter Gather模式下使用
		
		__IO uint32_t SRCSGADDR3;			//只在Scatter Gather模式下使用
		
		__I  uint32_t DSTSR;
		
		__I  uint32_t SRCSR;
		
		__IO uint32_t PARTLEN;				//Part Length，当 DMA 搬运 PARTLEN 个数据后，可产生 PART 中断
		
			 uint32_t RESERVED[2];
	} CH[6];
} DMA_TypeDef;


#define DMA_IE_CH0_Pos			    0		
#define DMA_IE_CH0_Msk			    (0x01 << DMA_IE_CH0_Pos)
#define DMA_IE_CH1_Pos			    1		
#define DMA_IE_CH1_Msk			    (0x01 << DMA_IE_CH1_Pos)
#define DMA_IE_CH2_Pos			    2		
#define DMA_IE_CH2_Msk			    (0x01 << DMA_IE_CH2_Pos)
#define DMA_IE_CH3_Pos			    3		
#define DMA_IE_CH3_Msk			    (0x01 << DMA_IE_CH3_Pos)
#define DMA_IE_CH4_Pos			    4		
#define DMA_IE_CH4_Msk			    (0x01 << DMA_IE_CH4_Pos)
#define DMA_IE_CH5_Pos			    5		
#define DMA_IE_CH5_Msk			    (0x01 << DMA_IE_CH5_Pos)

#define DMA_IM_CH0_Pos			    0		
#define DMA_IM_CH0_Msk			    (0x01 << DMA_IM_CH0_Pos)
#define DMA_IM_CH1_Pos			    1		
#define DMA_IM_CH1_Msk			    (0x01 << DMA_IM_CH1_Pos)
#define DMA_IM_CH2_Pos			    2		
#define DMA_IM_CH2_Msk			    (0x01 << DMA_IM_CH2_Pos)
#define DMA_IM_CH3_Pos			    3		
#define DMA_IM_CH3_Msk			    (0x01 << DMA_IM_CH3_Pos)
#define DMA_IM_CH4_Pos			    4		
#define DMA_IM_CH4_Msk			    (0x01 << DMA_IM_CH4_Pos)
#define DMA_IM_CH5_Pos			    5		
#define DMA_IM_CH5_Msk			    (0x01 << DMA_IM_CH5_Pos)

#define DMA_IF_CH0_Pos			    0		
#define DMA_IF_CH0_Msk			    (0x01 << DMA_IF_CH0_Pos)
#define DMA_IF_CH1_Pos			    1		
#define DMA_IF_CH1_Msk			    (0x01 << DMA_IF_CH1_Pos)
#define DMA_IF_CH2_Pos			    2		
#define DMA_IF_CH2_Msk			    (0x01 << DMA_IF_CH2_Pos)
#define DMA_IF_CH3_Pos			    3		
#define DMA_IF_CH3_Msk			    (0x01 << DMA_IF_CH3_Pos)
#define DMA_IF_CH4_Pos			    4		
#define DMA_IF_CH4_Msk			    (0x01 << DMA_IF_CH4_Pos)
#define DMA_IF_CH5_Pos			    5		
#define DMA_IF_CH5_Msk			    (0x01 << DMA_IF_CH5_Pos)

#define DMA_DSTIE_CH0SGHALF_Pos		0 		//Scatter-Gather Transfer Half Interrupt Enable
#define DMA_DSTIE_CH0SGHALF_Msk		(0x01 << DMA_DSTIE_CH0SGHALF_Pos)
#define DMA_DSTIE_CH0SGDONE_Pos		1 		//Scatter-Gather Transfer Done Interrupt Enable
#define DMA_DSTIE_CH0SGDONE_Msk		(0x01 << DMA_DSTIE_CH0SGDONE_Pos)
#define DMA_DSTIE_CH0PART_Pos 		2 		//当 DMA 搬运 PARTLEN 个数据后，可产生 PART 中断
#define DMA_DSTIE_CH0PART_Msk 		(0x01 << DMA_DSTIE_CH0PART_Pos)
#define DMA_DSTIE_CH1SGHALF_Pos		3
#define DMA_DSTIE_CH1SGHALF_Msk		(0x01 << DMA_DSTIE_CH1SGHALF_Pos)
#define DMA_DSTIE_CH1SGDONE_Pos		4
#define DMA_DSTIE_CH1SGDONE_Msk		(0x01 << DMA_DSTIE_CH1SGDONE_Pos)
#define DMA_DSTIE_CH1PART_Pos 		5
#define DMA_DSTIE_CH1PART_Msk 		(0x01 << DMA_DSTIE_CH1PART_Pos)
#define DMA_DSTIE_CH2SGHALF_Pos		6
#define DMA_DSTIE_CH2SGHALF_Msk		(0x01 << DMA_DSTIE_CH2SGHALF_Pos)
#define DMA_DSTIE_CH2SGDONE_Pos		7
#define DMA_DSTIE_CH2SGDONE_Msk		(0x01 << DMA_DSTIE_CH2SGDONE_Pos)
#define DMA_DSTIE_CH2PART_Pos 		8
#define DMA_DSTIE_CH2PART_Msk 		(0x01 << DMA_DSTIE_CH2PART_Pos)
#define DMA_DSTIE_CH3SGHALF_Pos		9
#define DMA_DSTIE_CH3SGHALF_Msk		(0x01 << DMA_DSTIE_CH3SGHALF_Pos)
#define DMA_DSTIE_CH3SGDONE_Pos		10
#define DMA_DSTIE_CH3SGDONE_Msk		(0x01 << DMA_DSTIE_CH3SGDONE_Pos)
#define DMA_DSTIE_CH3PART_Pos 		11
#define DMA_DSTIE_CH3PART_Msk 		(0x01 << DMA_DSTIE_CH3PART_Pos)
#define DMA_DSTIE_CH4SGHALF_Pos		12
#define DMA_DSTIE_CH4SGHALF_Msk		(0x01 << DMA_DSTIE_CH4SGHALF_Pos)
#define DMA_DSTIE_CH4SGDONE_Pos		13
#define DMA_DSTIE_CH4SGDONE_Msk		(0x01 << DMA_DSTIE_CH4SGDONE_Pos)
#define DMA_DSTIE_CH4PART_Pos 		14
#define DMA_DSTIE_CH4PART_Msk 		(0x01 << DMA_DSTIE_CH4PART_Pos)
#define DMA_DSTIE_CH5SGHALF_Pos		15
#define DMA_DSTIE_CH5SGHALF_Msk		(0x01 << DMA_DSTIE_CH5SGHALF_Pos)
#define DMA_DSTIE_CH5SGDONE_Pos		16
#define DMA_DSTIE_CH5SGDONE_Msk		(0x01 << DMA_DSTIE_CH5SGDONE_Pos)
#define DMA_DSTIE_CH5PART_Pos 		17
#define DMA_DSTIE_CH5PART_Msk 		(0x01 << DMA_DSTIE_CH5PART_Pos)

#define DMA_DSTIM_CH0SGHALF_Pos		0 
#define DMA_DSTIM_CH0SGHALF_Msk		(0x01 << DMA_DSTIM_CH0SGHALF_Pos)
#define DMA_DSTIM_CH0SGDONE_Pos		1
#define DMA_DSTIM_CH0SGDONE_Msk		(0x01 << DMA_DSTIM_CH0SGDONE_Pos)
#define DMA_DSTIM_CH0PART_Pos 		2
#define DMA_DSTIM_CH0PART_Msk 		(0x01 << DMA_DSTIM_CH0PART_Pos)
#define DMA_DSTIM_CH1SGHALF_Pos		3
#define DMA_DSTIM_CH1SGHALF_Msk		(0x01 << DMA_DSTIM_CH1SGHALF_Pos)
#define DMA_DSTIM_CH1SGDONE_Pos		4
#define DMA_DSTIM_CH1SGDONE_Msk		(0x01 << DMA_DSTIM_CH1SGDONE_Pos)
#define DMA_DSTIM_CH1PART_Pos 		5
#define DMA_DSTIM_CH1PART_Msk 		(0x01 << DMA_DSTIM_CH1PART_Pos)
#define DMA_DSTIM_CH2SGHALF_Pos		6
#define DMA_DSTIM_CH2SGHALF_Msk		(0x01 << DMA_DSTIM_CH2SGHALF_Pos)
#define DMA_DSTIM_CH2SGDONE_Pos		7
#define DMA_DSTIM_CH2SGDONE_Msk		(0x01 << DMA_DSTIM_CH2SGDONE_Pos)
#define DMA_DSTIM_CH2PART_Pos 		8
#define DMA_DSTIM_CH2PART_Msk 		(0x01 << DMA_DSTIM_CH2PART_Pos)
#define DMA_DSTIM_CH3SGHALF_Pos		9
#define DMA_DSTIM_CH3SGHALF_Msk		(0x01 << DMA_DSTIM_CH3SGHALF_Pos)
#define DMA_DSTIM_CH3SGDONE_Pos		10
#define DMA_DSTIM_CH3SGDONE_Msk		(0x01 << DMA_DSTIM_CH3SGDONE_Pos)
#define DMA_DSTIM_CH3PART_Pos 		11
#define DMA_DSTIM_CH3PART_Msk 		(0x01 << DMA_DSTIM_CH3PART_Pos)
#define DMA_DSTIM_CH4SGHALF_Pos		12
#define DMA_DSTIM_CH4SGHALF_Msk		(0x01 << DMA_DSTIM_CH4SGHALF_Pos)
#define DMA_DSTIM_CH4SGDONE_Pos		13
#define DMA_DSTIM_CH4SGDONE_Msk		(0x01 << DMA_DSTIM_CH4SGDONE_Pos)
#define DMA_DSTIM_CH4PART_Pos 		14
#define DMA_DSTIM_CH4PART_Msk 		(0x01 << DMA_DSTIM_CH4PART_Pos)
#define DMA_DSTIM_CH5SGHALF_Pos		15
#define DMA_DSTIM_CH5SGHALF_Msk		(0x01 << DMA_DSTIM_CH5SGHALF_Pos)
#define DMA_DSTIM_CH5SGDONE_Pos		16
#define DMA_DSTIM_CH5SGDONE_Msk		(0x01 << DMA_DSTIM_CH5SGDONE_Pos)
#define DMA_DSTIM_CH5PART_Pos 		17
#define DMA_DSTIM_CH5PART_Msk 		(0x01 << DMA_DSTIM_CH5PART_Pos)

#define DMA_DSTIF_CH0SGHALF_Pos		0 
#define DMA_DSTIF_CH0SGHALF_Msk		(0x01 << DMA_DSTIF_CH0SGHALF_Pos)
#define DMA_DSTIF_CH0SGDONE_Pos		1
#define DMA_DSTIF_CH0SGDONE_Msk		(0x01 << DMA_DSTIF_CH0SGDONE_Pos)
#define DMA_DSTIF_CH0PART_Pos 		2
#define DMA_DSTIF_CH0PART_Msk 		(0x01 << DMA_DSTIF_CH0PART_Pos)
#define DMA_DSTIF_CH1SGHALF_Pos		3
#define DMA_DSTIF_CH1SGHALF_Msk		(0x01 << DMA_DSTIF_CH1SGHALF_Pos)
#define DMA_DSTIF_CH1SGDONE_Pos		4
#define DMA_DSTIF_CH1SGDONE_Msk		(0x01 << DMA_DSTIF_CH1SGDONE_Pos)
#define DMA_DSTIF_CH1PART_Pos 		5
#define DMA_DSTIF_CH1PART_Msk 		(0x01 << DMA_DSTIF_CH1PART_Pos)
#define DMA_DSTIF_CH2SGHALF_Pos		6
#define DMA_DSTIF_CH2SGHALF_Msk		(0x01 << DMA_DSTIF_CH2SGHALF_Pos)
#define DMA_DSTIF_CH2SGDONE_Pos		7
#define DMA_DSTIF_CH2SGDONE_Msk		(0x01 << DMA_DSTIF_CH2SGDONE_Pos)
#define DMA_DSTIF_CH2PART_Pos 		8
#define DMA_DSTIF_CH2PART_Msk 		(0x01 << DMA_DSTIF_CH2PART_Pos)
#define DMA_DSTIF_CH3SGHALF_Pos		9
#define DMA_DSTIF_CH3SGHALF_Msk		(0x01 << DMA_DSTIF_CH3SGHALF_Pos)
#define DMA_DSTIF_CH3SGDONE_Pos		10
#define DMA_DSTIF_CH3SGDONE_Msk		(0x01 << DMA_DSTIF_CH3SGDONE_Pos)
#define DMA_DSTIF_CH3PART_Pos 		11
#define DMA_DSTIF_CH3PART_Msk 		(0x01 << DMA_DSTIF_CH3PART_Pos)
#define DMA_DSTIF_CH4SGHALF_Pos		12
#define DMA_DSTIF_CH4SGHALF_Msk		(0x01 << DMA_DSTIF_CH4SGHALF_Pos)
#define DMA_DSTIF_CH4SGDONE_Pos		13
#define DMA_DSTIF_CH4SGDONE_Msk		(0x01 << DMA_DSTIF_CH4SGDONE_Pos)
#define DMA_DSTIF_CH4PART_Pos 		14
#define DMA_DSTIF_CH4PART_Msk 		(0x01 << DMA_DSTIF_CH4PART_Pos)
#define DMA_DSTIF_CH5SGHALF_Pos		15
#define DMA_DSTIF_CH5SGHALF_Msk		(0x01 << DMA_DSTIF_CH5SGHALF_Pos)
#define DMA_DSTIF_CH5SGDONE_Pos		16
#define DMA_DSTIF_CH5SGDONE_Msk		(0x01 << DMA_DSTIF_CH5SGDONE_Pos)
#define DMA_DSTIF_CH5PART_Pos 		17
#define DMA_DSTIF_CH5PART_Msk 		(0x01 << DMA_DSTIF_CH5PART_Pos)

#define DMA_SRCIE_CH0SGHALF_Pos		0 		//Scatter-Gather Transfer Half Interrupt Enable
#define DMA_SRCIE_CH0SGHALF_Msk		(0x01 << DMA_SRCIE_CH0SGHALF_Pos)
#define DMA_SRCIE_CH0SGDONE_Pos		1 		//Scatter-Gather Transfer Done Interrupt Enable
#define DMA_SRCIE_CH0SGDONE_Msk		(0x01 << DMA_SRCIE_CH0SGDONE_Pos)
#define DMA_SRCIE_CH0PART_Pos 		2 		//当 DMA 搬运 PARTLEN 个数据后，可产生 PART 中断
#define DMA_SRCIE_CH0PART_Msk 		(0x01 << DMA_SRCIE_CH0PART_Pos)
#define DMA_SRCIE_CH1SGHALF_Pos		3
#define DMA_SRCIE_CH1SGHALF_Msk		(0x01 << DMA_SRCIE_CH1SGHALF_Pos)
#define DMA_SRCIE_CH1SGDONE_Pos		4
#define DMA_SRCIE_CH1SGDONE_Msk		(0x01 << DMA_SRCIE_CH1SGDONE_Pos)
#define DMA_SRCIE_CH1PART_Pos 		5
#define DMA_SRCIE_CH1PART_Msk 		(0x01 << DMA_SRCIE_CH1PART_Pos)
#define DMA_SRCIE_CH2SGHALF_Pos		6
#define DMA_SRCIE_CH2SGHALF_Msk		(0x01 << DMA_SRCIE_CH2SGHALF_Pos)
#define DMA_SRCIE_CH2SGDONE_Pos		7
#define DMA_SRCIE_CH2SGDONE_Msk		(0x01 << DMA_SRCIE_CH2SGDONE_Pos)
#define DMA_SRCIE_CH2PART_Pos 		8
#define DMA_SRCIE_CH2PART_Msk 		(0x01 << DMA_SRCIE_CH2PART_Pos)
#define DMA_SRCIE_CH3SGHALF_Pos		9
#define DMA_SRCIE_CH3SGHALF_Msk		(0x01 << DMA_SRCIE_CH3SGHALF_Pos)
#define DMA_SRCIE_CH3SGDONE_Pos		10
#define DMA_SRCIE_CH3SGDONE_Msk		(0x01 << DMA_SRCIE_CH3SGDONE_Pos)
#define DMA_SRCIE_CH3PART_Pos 		11
#define DMA_SRCIE_CH3PART_Msk 		(0x01 << DMA_SRCIE_CH3PART_Pos)
#define DMA_SRCIE_CH4SGHALF_Pos		12
#define DMA_SRCIE_CH4SGHALF_Msk		(0x01 << DMA_SRCIE_CH4SGHALF_Pos)
#define DMA_SRCIE_CH4SGDONE_Pos		13
#define DMA_SRCIE_CH4SGDONE_Msk		(0x01 << DMA_SRCIE_CH4SGDONE_Pos)
#define DMA_SRCIE_CH4PART_Pos 		14
#define DMA_SRCIE_CH4PART_Msk 		(0x01 << DMA_SRCIE_CH4PART_Pos)
#define DMA_SRCIE_CH5SGHALF_Pos		15
#define DMA_SRCIE_CH5SGHALF_Msk		(0x01 << DMA_SRCIE_CH5SGHALF_Pos)
#define DMA_SRCIE_CH5SGDONE_Pos		16
#define DMA_SRCIE_CH5SGDONE_Msk		(0x01 << DMA_SRCIE_CH5SGDONE_Pos)
#define DMA_SRCIE_CH5PART_Pos 		17
#define DMA_SRCIE_CH5PART_Msk 		(0x01 << DMA_SRCIE_CH5PART_Pos)

