Synwit-Co-Ltd/SWM342_Lib/SWM342_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM342.h
#define DMA_SRCIM_CH0SGHALF_Pos		0 
#define DMA_SRCIM_CH0SGHALF_Msk		(0x01 << DMA_SRCIM_CH0SGHALF_Pos)
#define DMA_SRCIM_CH0SGDONE_Pos		1
#define DMA_SRCIM_CH0SGDONE_Msk		(0x01 << DMA_SRCIM_CH0SGDONE_Pos)
#define DMA_SRCIM_CH0PART_Pos 		2
#define DMA_SRCIM_CH0PART_Msk 		(0x01 << DMA_SRCIM_CH0PART_Pos)
#define DMA_SRCIM_CH1SGHALF_Pos		3
#define DMA_SRCIM_CH1SGHALF_Msk		(0x01 << DMA_SRCIM_CH1SGHALF_Pos)
#define DMA_SRCIM_CH1SGDONE_Pos		4
#define DMA_SRCIM_CH1SGDONE_Msk		(0x01 << DMA_SRCIM_CH1SGDONE_Pos)
#define DMA_SRCIM_CH1PART_Pos 		5
#define DMA_SRCIM_CH1PART_Msk 		(0x01 << DMA_SRCIM_CH1PART_Pos)
#define DMA_SRCIM_CH2SGHALF_Pos		6
#define DMA_SRCIM_CH2SGHALF_Msk		(0x01 << DMA_SRCIM_CH2SGHALF_Pos)
#define DMA_SRCIM_CH2SGDONE_Pos		7
#define DMA_SRCIM_CH2SGDONE_Msk		(0x01 << DMA_SRCIM_CH2SGDONE_Pos)
#define DMA_SRCIM_CH2PART_Pos 		8
#define DMA_SRCIM_CH2PART_Msk 		(0x01 << DMA_SRCIM_CH2PART_Pos)
#define DMA_SRCIM_CH3SGHALF_Pos		9
#define DMA_SRCIM_CH3SGHALF_Msk		(0x01 << DMA_SRCIM_CH3SGHALF_Pos)
#define DMA_SRCIM_CH3SGDONE_Pos		10
#define DMA_SRCIM_CH3SGDONE_Msk		(0x01 << DMA_SRCIM_CH3SGDONE_Pos)
#define DMA_SRCIM_CH3PART_Pos 		11
#define DMA_SRCIM_CH3PART_Msk 		(0x01 << DMA_SRCIM_CH3PART_Pos)
#define DMA_SRCIM_CH4SGHALF_Pos		12
#define DMA_SRCIM_CH4SGHALF_Msk		(0x01 << DMA_SRCIM_CH4SGHALF_Pos)
#define DMA_SRCIM_CH4SGDONE_Pos		13
#define DMA_SRCIM_CH4SGDONE_Msk		(0x01 << DMA_SRCIM_CH4SGDONE_Pos)
#define DMA_SRCIM_CH4PART_Pos 		14
#define DMA_SRCIM_CH4PART_Msk 		(0x01 << DMA_SRCIM_CH4PART_Pos)
#define DMA_SRCIM_CH5SGHALF_Pos		15
#define DMA_SRCIM_CH5SGHALF_Msk		(0x01 << DMA_SRCIM_CH5SGHALF_Pos)
#define DMA_SRCIM_CH5SGDONE_Pos		16
#define DMA_SRCIM_CH5SGDONE_Msk		(0x01 << DMA_SRCIM_CH5SGDONE_Pos)
#define DMA_SRCIM_CH5PART_Pos 		17
#define DMA_SRCIM_CH5PART_Msk 		(0x01 << DMA_SRCIM_CH5PART_Pos)

#define DMA_SRCIF_CH0SGHALF_Pos		0 
#define DMA_SRCIF_CH0SGHALF_Msk		(0x01 << DMA_SRCIF_CH0SGHALF_Pos)
#define DMA_SRCIF_CH0SGDONE_Pos		1
#define DMA_SRCIF_CH0SGDONE_Msk		(0x01 << DMA_SRCIF_CH0SGDONE_Pos)
#define DMA_SRCIF_CH0PART_Pos 		2
#define DMA_SRCIF_CH0PART_Msk 		(0x01 << DMA_SRCIF_CH0PART_Pos)
#define DMA_SRCIF_CH1SGHALF_Pos		3
#define DMA_SRCIF_CH1SGHALF_Msk		(0x01 << DMA_SRCIF_CH1SGHALF_Pos)
#define DMA_SRCIF_CH1SGDONE_Pos		4
#define DMA_SRCIF_CH1SGDONE_Msk		(0x01 << DMA_SRCIF_CH1SGDONE_Pos)
#define DMA_SRCIF_CH1PART_Pos 		5
#define DMA_SRCIF_CH1PART_Msk 		(0x01 << DMA_SRCIF_CH1PART_Pos)
#define DMA_SRCIF_CH2SGHALF_Pos		6
#define DMA_SRCIF_CH2SGHALF_Msk		(0x01 << DMA_SRCIF_CH2SGHALF_Pos)
#define DMA_SRCIF_CH2SGDONE_Pos		7
#define DMA_SRCIF_CH2SGDONE_Msk		(0x01 << DMA_SRCIF_CH2SGDONE_Pos)
#define DMA_SRCIF_CH2PART_Pos 		8
#define DMA_SRCIF_CH2PART_Msk 		(0x01 << DMA_SRCIF_CH2PART_Pos)
#define DMA_SRCIF_CH3SGHALF_Pos		9
#define DMA_SRCIF_CH3SGHALF_Msk		(0x01 << DMA_SRCIF_CH3SGHALF_Pos)
#define DMA_SRCIF_CH3SGDONE_Pos		10
#define DMA_SRCIF_CH3SGDONE_Msk		(0x01 << DMA_SRCIF_CH3SGDONE_Pos)
#define DMA_SRCIF_CH3PART_Pos 		11
#define DMA_SRCIF_CH3PART_Msk 		(0x01 << DMA_SRCIF_CH3PART_Pos)
#define DMA_SRCIF_CH4SGHALF_Pos		12
#define DMA_SRCIF_CH4SGHALF_Msk		(0x01 << DMA_SRCIF_CH4SGHALF_Pos)
#define DMA_SRCIF_CH4SGDONE_Pos		13
#define DMA_SRCIF_CH4SGDONE_Msk		(0x01 << DMA_SRCIF_CH4SGDONE_Pos)
#define DMA_SRCIF_CH4PART_Pos 		14
#define DMA_SRCIF_CH4PART_Msk 		(0x01 << DMA_SRCIF_CH4PART_Pos)
#define DMA_SRCIF_CH5SGHALF_Pos		15
#define DMA_SRCIF_CH5SGHALF_Msk		(0x01 << DMA_SRCIF_CH5SGHALF_Pos)
#define DMA_SRCIF_CH5SGDONE_Pos		16
#define DMA_SRCIF_CH5SGDONE_Msk		(0x01 << DMA_SRCIF_CH5SGDONE_Pos)
#define DMA_SRCIF_CH5PART_Pos 		17
#define DMA_SRCIF_CH5PART_Msk 		(0x01 << DMA_SRCIF_CH5PART_Pos)

#define DMA_CR_LEN_Pos				0       //此通道传输单位个数
#define DMA_CR_LEN_Msk				(0xFFFFF<< DMA_CR_LEN_Pos)
#define DMA_CR_RXEN_Pos				24		//软件启动传输，传输方向为SRC-->DST
#define DMA_CR_RXEN_Msk				(0x01 << DMA_CR_RXEN_Pos)
#define DMA_CR_TXEN_Pos				25		//软件启动传输，传输方向为DST-->SRC
#define DMA_CR_TXEN_Msk				(0x01 << DMA_CR_TXEN_Pos)
#define DMA_CR_AUTORE_Pos			26      //Auto Restart, 通道在传输完成后，是否自动重新启动
#define DMA_CR_AUTORE_Msk			(0x01 << DMA_CR_AUTORE_Pos)
#define DMA_CR_STEPOP_Pos			27		//Step Operation, 步进传输，触发1次传送1个单位数据
#define DMA_CR_STEPOP_Msk			(0x01 << DMA_CR_STEPOP_Pos)
#define DMA_CR_ABORT_Pos			28		//提前终止传输，将DMA内部Buffer中的数据冲刷出来
#define DMA_CR_ABORT_Msk			(0x01 << DMA_CR_ABORT_Pos)

#define DMA_AM_DSTAM_Pos			0       //Address Mode	0 地址固定    1 地址递增    2 scatter gather模式
#define DMA_AM_DSTAM_Msk			(0x03 << DMA_AM_DSTAM_Pos)
#define DMA_AM_DSTBIT_Pos			2		//传输位宽，0 字节    1 半字    2 字
#define DMA_AM_DSTBIT_Msk			(0x03 << DMA_AM_DSTBIT_Pos)
#define DMA_AM_DSTBURST_Pos			4		//传输类型，0 Single    1 Burst（Inc4）
#define DMA_AM_DSTBURST_Msk			(0x01 << DMA_AM_DSTBURST_Pos)
#define DMA_AM_SRCAM_Pos			8
#define DMA_AM_SRCAM_Msk			(0x03 << DMA_AM_SRCAM_Pos)
#define DMA_AM_SRCBIT_Pos			10
#define DMA_AM_SRCBIT_Msk			(0x03 << DMA_AM_SRCBIT_Pos)
#define DMA_AM_SRCBURST_Pos			12
#define DMA_AM_SRCBURST_Msk			(0x01 << DMA_AM_SRCBURST_Pos)

#define DMA_MUX_DSTHSSIG_Pos		0		//目标侧握手信号（handshake signal）
#define DMA_MUX_DSTHSSIG_Msk		(0x03 << DMA_MUX_DSTHSSIG_Pos)
#define DMA_MUX_DSTHSEN_Pos			2		//目标侧握手使能（handshake enable）
#define DMA_MUX_DSTHSEN_Msk			(0x01 << DMA_MUX_DSTHSEN_Pos)
#define DMA_MUX_SRCHSSIG_Pos		8		//源侧握手信号
#define DMA_MUX_SRCHSSIG_Msk		(0x03 << DMA_MUX_SRCHSSIG_Pos)
#define DMA_MUX_SRCHSEN_Pos			10		//源侧握手使能
#define DMA_MUX_SRCHSEN_Msk			(0x01 << DMA_MUX_SRCHSEN_Pos)
#define DMA_MUX_EXTHSSIG_Pos		16		//外部握手信号，0 TIMR0   1 TIMR1   2 TIMR2   3 TIMR3   4 TIMR4   5 DMA_TRIG0   6 DMA_TRIG1
#define DMA_MUX_EXTHSSIG_Msk		(0x07 << DMA_MUX_EXTHSSIG_Pos)
#define DMA_MUX_EXTHSEN_Pos			19		//外部握手使能，0 软件置位CR.RXEN/TXEN启动传输   1 EXTHSSRC选中的触发源启动传输
#define DMA_MUX_EXTHSEN_Msk			(0x01 << DMA_MUX_EXTHSEN_Pos)

#define DMA_DSTSR_LEN_Pos			0		//剩余传输量
#define DMA_DSTSR_LEN_Msk			(0xFFFFF<<DMA_DSTSR_LEN_Pos)
#define DMA_DSTSR_ERR_Pos			31		//长度配置错误
#define DMA_DSTSR_ERR_Msk			(0x01u<< DMA_DSTSR_ERR_Pos)

#define DMA_SRCSR_LEN_Pos			0
#define DMA_SRCSR_LEN_Msk			(0xFFFFF<<DMA_SRCSR_LEN_Pos)
#define DMA_SRCSR_ERR_Pos			31
#define DMA_SRCSR_ERR_Msk			(0x01u<< DMA_SRCSR_ERR_Pos)




