Synwit-Co-Ltd/SWM342_Lib/SWM342_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM342.h
typedef struct {
	__IO uint32_t CR;
	
	__IO uint32_t SR;
	
	struct {
		__IO uint32_t CR0;
		
		__IO uint32_t CR1;
	} TX[3];
	
	__IO uint32_t AFID[6];					//Acceptance Filter ID
	
	__IO uint32_t AFDB;						//Acceptance Filter Data Byte
	
	__IO uint32_t AFCR;						//Acceptance Filter Control Register
	
	__IO uint32_t AFMID[2];					//Acceptance Filter ID Mask
	
	__IO uint32_t AFMDB;					//Acceptance Filter Data Byte Mask
	
	__IO uint32_t AFMCR;					//Acceptance Filter Mask Control Register
	
	struct {
		__IO uint32_t CR0;
		
		__IO uint32_t CR1;
	} RX[2];
	
	__IO uint32_t NBT0;						//Nominal Bit Timing
	__IO uint32_t NBT1;
	
	__IO uint32_t DBT;						//Data Bit Timing
	
	__IO uint32_t ERRCNT;
	
	__IO uint32_t ERRSR;
	
	__IO uint32_t RXTS;						//RX Timestamp
	
	__IO uint32_t IF;
	
	__IO uint32_t TXBUF[3][16];
	
	__IO uint32_t RXBUF[2][16];
} CANFD_TypeDef;


#define CANFD_CR_RFF1CLR_Pos		1		//RX FIFO 1 Clear (3 frame depth)
#define CANFD_CR_RFF1CLR_Msk		(0x01 << CANFD_CR_RFF1CLR_Pos)
#define CANFD_CR_RFF0CLR_Pos		2
#define CANFD_CR_RFF0CLR_Msk		(0x01 << CANFD_CR_RFF0CLR_Pos)
#define CANFD_CR_TBF2REQ_Pos		3		//TX Buffer 2 Send Request
#define CANFD_CR_TBF2REQ_Msk		(0x01 << CANFD_CR_TBF2REQ_Pos)
#define CANFD_CR_TBF1REQ_Pos		4
#define CANFD_CR_TBF1REQ_Msk		(0x01 << CANFD_CR_TBF1REQ_Pos)
#define CANFD_CR_TBF0REQ_Pos		5
#define CANFD_CR_TBF0REQ_Msk		(0x01 << CANFD_CR_TBF0REQ_Pos)
#define CANFD_CR_RFF1POP_Pos		6		//Pop 1 frame from RX FIFO 1
#define CANFD_CR_RFF1POP_Msk		(0x01 << CANFD_CR_RFF1POP_Pos)
#define CANFD_CR_RFF0POP_Pos		7
#define CANFD_CR_RFF0POP_Msk		(0x01 << CANFD_CR_RFF0POP_Pos)
#define CANFD_CR_IERXOK_Pos			11
#define CANFD_CR_IERXOK_Msk			(0x01 << CANFD_CR_IERXOK_Pos)
#define CANFD_CR_IETXOK_Pos			12
#define CANFD_CR_IETXOK_Msk			(0x01 << CANFD_CR_IETXOK_Pos)
#define CANFD_CR_IEERR_Pos			13
#define CANFD_CR_IEERR_Msk			(0x01 << CANFD_CR_IEERR_Pos)
#define CANFD_CR_IERXOV_Pos			14
#define CANFD_CR_IERXOV_Msk			(0x01 << CANFD_CR_IERXOV_Pos)
#define CANFD_CR_IEWKUP_Pos			15
#define CANFD_CR_IEWKUP_Msk			(0x01 << CANFD_CR_IEWKUP_Pos)
#define CANFD_CR_DBEN_Pos			22		//RX Debounce Enable
#define CANFD_CR_DBEN_Msk			(0x01 << CANFD_CR_DBEN_Pos)
#define CANFD_CR_TSEN_Pos			23		//Timestamp Enable
#define CANFD_CR_TSEN_Msk			(0x01 << CANFD_CR_TSEN_Pos)
#define CANFD_CR_MODE_Pos			24		//0 Config   1 Normal   2 Sleep   3 Listen   4 Loopback
#define CANFD_CR_MODE_Msk			(0x07 << CANFD_CR_MODE_Pos)
#define CANFD_CR_RETX_Pos			27		//retransmission times, 0 always   1 not   2 3-times at most   3 8-times at most
#define CANFD_CR_RETX_Msk			(0x03 << CANFD_CR_RETX_Pos)
#define CANFD_CR_TXOV_Pos			29		//TX 1 OVERLOAD frame for RX FIFO full condition
#define CANFD_CR_TXOV_Msk			(0x01 << CANFD_CR_TXOV_Pos)
#define CANFD_CR_RESET_Pos			30		//Reset request, auto clear after done
#define CANFD_CR_RESET_Msk			(0x01 << CANFD_CR_RESET_Pos)

#define CANFD_SR_RXOV_Pos			2		//0 no buffer overflow   1 RX buffer0 overflow   2 RX buffer1 overflow   3 both overflow
#define CANFD_SR_RXOV_Msk			(0x03 << CANFD_SR_RXOV_Pos)
#define CANFD_SR_RXBUSY_Pos			4		//1 a message is receiving
#define CANFD_SR_RXBUSY_Msk			(0x01 << CANFD_SR_RXBUSY_Pos)
#define CANFD_SR_TXBUSY_Pos			5		//1 a message is transmitting
#define CANFD_SR_TXBUSY_Msk			(0x01 << CANFD_SR_TXBUSY_Pos)
#define CANFD_SR_ERRWARN_Pos		6		//RXERR或TXERR之一达到96
#define CANFD_SR_ERRWARN_Msk		(0x01 << CANFD_SR_ERRWARN_Pos)
#define CANFD_SR_BUSOFF_Pos			7		//TXERR达到256置位，然后CAN控制器等待128个连续11位隐性位以离开Busoff状态
#define CANFD_SR_BUSOFF_Msk			(0x01 << CANFD_SR_BUSOFF_Pos)
#define CANFD_SR_RFF1LVL_Pos		9		//RX FIFO 1 level, 0 empty   1 one message   2 two message   3 full
#define CANFD_SR_RFF1LVL_Msk		(0x03 << CANFD_SR_RFF1LVL_Pos)
#define CANFD_SR_RFF0LVL_Pos		11
#define CANFD_SR_RFF0LVL_Msk		(0x03 << CANFD_SR_RFF0LVL_Pos)
#define CANFD_SR_TBFTXING_Pos		16		//0 No buffer is transmitting   1 Buffer0 is transmitting   2 Buffer1 is transmitting   3 Buffer2 is transmitting
#define CANFD_SR_TBFTXING_Msk		(0x03 << CANFD_SR_TBFTXING_Pos)
#define CANFD_SR_TBF2ARBLOST_Pos	18 		//TX Buffer 2 transmit arbitration lost
#define CANFD_SR_TBF2ARBLOST_Msk	(0x01 << CANFD_SR_TBF2ARBLOST_Pos)
#define CANFD_SR_TBF1ARBLOST_Pos	19
#define CANFD_SR_TBF1ARBLOST_Msk	(0x01 << CANFD_SR_TBF1ARBLOST_Pos)
#define CANFD_SR_TBF0ARBLOST_Pos	20
#define CANFD_SR_TBF0ARBLOST_Msk	(0x01 << CANFD_SR_TBF0ARBLOST_Pos)
#define CANFD_SR_TBF2ARORT_Pos		21		//TX Buffer 2 transmit abort
#define CANFD_SR_TBF2ARORT_Msk		(0x01 << CANFD_SR_TBF2ARORT_Pos)
#define CANFD_SR_TBF1ARORT_Pos		22
#define CANFD_SR_TBF1ARORT_Msk		(0x01 << CANFD_SR_TBF1ARORT_Pos)
#define CANFD_SR_TBF0ARORT_Pos		23
#define CANFD_SR_TBF0ARORT_Msk		(0x01 << CANFD_SR_TBF0ARORT_Pos)

#define CANFD_CR0_RESI_Pos			5		//received ESI bit, 0 frame is from error active node   1 frame is from error passive node
#define CANFD_CR0_RESI_Msk			(0x01 << CANFD_CR0_RESI_Pos)
#define CANFD_CR0_BRSW_Pos			6		//Bit rate switch
#define CANFD_CR0_BRSW_Msk			(0x01 << CANFD_CR0_BRSW_Pos)
#define CANFD_CR0_FDEN_Pos			7		//1 FD frame   0 Non-FD frame
#define CANFD_CR0_FDEN_Msk			(0x01 << CANFD_CR0_FDEN_Pos)
#define CANFD_CR0_IDE_Pos			14		//0 standard frame   1 extended format
#define CANFD_CR0_IDE_Msk			(0x01 << CANFD_CR0_IDE_Pos)
#define CANFD_CR0_RTR_Pos			15
#define CANFD_CR0_RTR_Msk			(0x01 << CANFD_CR0_RTR_Pos)
#define CANFD_CR0_EID0T9_Pos		22		//Extended ID bit 0 to 9
#define CANFD_CR0_EID0T9_Msk		(0x3FFu<< CANFD_CR0_EID0T9_Pos)

#define CANFD_CR1_EID10T17_Pos		0 		//Extended ID bit 10 to 17
#define CANFD_CR1_EID10T17_Msk		(0xFF << CANFD_CR1_EID10T17_Pos)
#define CANFD_CR1_DLC_Pos			8 		//Data Length Code
#define CANFD_CR1_DLC_Msk			(0x0F << CANFD_CR1_DLC_Pos)
#define CANFD_CR1_BID_Pos			13		//Standard Format ID and Extended Format Base ID
#define CANFD_CR1_BID_Msk			(0x7FF<< CANFD_CR1_BID_Pos)

#define CANFD_AFID_EID_Pos			3		//Extended ID
#define CANFD_AFID_EID_Msk			(0x3FFFF<< CANFD_AFID_EID_Pos)
#define CANFD_AFID_BID_Pos			21		//Standard Format ID and Extended Format Base ID
#define CANFD_AFID_BID_Msk			(0x7FFu<< CANFD_AFID_BID_Pos)

#define CANFD_AFDB_RX0B0_Pos		0
#define CANFD_AFDB_RX0B0_Msk		(0xFF << CANFD_AFDB_RX0B0_Pos)
#define CANFD_AFDB_RX0B1_Pos		8
#define CANFD_AFDB_RX0B1_Msk		(0xFF << CANFD_AFDB_RX0B1_Pos)
#define CANFD_AFDB_RX1B0_Pos		16
#define CANFD_AFDB_RX1B0_Msk		(0xFF << CANFD_AFDB_RX1B0_Pos)
#define CANFD_AFDB_RX1B1_Pos		24
#define CANFD_AFDB_RX1B1_Msk		(0xFF << CANFD_AFDB_RX1B1_Pos)

