Synwit-Co-Ltd/SWM342_Lib/SWM342_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM342.h
#define CANFD_AFCR_RBF1DB1_Pos		2		//RX Buffer 1 data byte 1 filter enable
#define CANFD_AFCR_RBF1DB1_Msk		(0x01 << CANFD_AFCR_RBF1DB1_Pos)
#define CANFD_AFCR_RBF1DB0_Pos		3		//RX Buffer 1 data byte 0 filter enable
#define CANFD_AFCR_RBF1DB0_Msk		(0x01 << CANFD_AFCR_RBF1DB0_Pos)
#define CANFD_AFCR_RBF0DB1_Pos		4		//RX Buffer 0 data byte 1 filter enable
#define CANFD_AFCR_RBF0DB1_Msk		(0x01 << CANFD_AFCR_RBF0DB1_Pos)
#define CANFD_AFCR_RBF0DB0_Pos		5		//RX Buffer 0 data byte 0 filter enable
#define CANFD_AFCR_RBF0DB0_Msk		(0x01 << CANFD_AFCR_RBF0DB0_Pos)
#define CANFD_AFCR_RBF1ID_Pos		6		//RX Buffer 1 ID filter enable
#define CANFD_AFCR_RBF1ID_Msk		(0x01 << CANFD_AFCR_RBF1ID_Pos)
#define CANFD_AFCR_RBF0ID_Pos		7		//RX Buffer 0 ID filter enable, By only setting this bit, receive buffer0 is allowed to receive message
#define CANFD_AFCR_RBF0ID_Msk		(0x01 << CANFD_AFCR_RBF0ID_Pos)
#define CANFD_AFCR_FD_Pos			10		//0 both non-FD and FD frame can be accepted   1 only non-FD frame   2 only FD frame
#define CANFD_AFCR_FD_Msk			(0x03 << CANFD_AFCR_FD_Pos)
#define CANFD_AFCR_RTR_Pos			12		//0 both data and remote frame can be accepted   1 only data frame   2 only remote frame
#define CANFD_AFCR_RTR_Msk			(0x03 << CANFD_AFCR_RTR_Pos)
#define CANFD_AFCR_IDE_Pos			14		//0 both standard and extended frame can be accepted   1 only standard frame   2 only extended frame
#define CANFD_AFCR_IDE_Msk			(0x03 << CANFD_AFCR_IDE_Pos)

#define CANFD_AFMID_EID_Pos			3		//Extended ID
#define CANFD_AFMID_EID_Msk			(0x3FFFF<< CANFD_AFMID_EID_Pos)
#define CANFD_AFMID_BID_Pos			21		//Standard Format ID and Extended Format Base ID
#define CANFD_AFMID_BID_Msk			(0x7FFu<< CANFD_AFMID_BID_Pos)

#define CANFD_AFMDB_RX0B0_Pos		0
#define CANFD_AFMDB_RX0B0_Msk		(0xFF << CANFD_AFMDB_RX0B0_Pos)
#define CANFD_AFMDB_RX0B1_Pos		8
#define CANFD_AFMDB_RX0B1_Msk		(0xFF << CANFD_AFMDB_RX0B1_Pos)
#define CANFD_AFMDB_RX1B0_Pos		16
#define CANFD_AFMDB_RX1B0_Msk		(0xFF << CANFD_AFMDB_RX1B0_Pos)
#define CANFD_AFMDB_RX1B1_Pos		24
#define CANFD_AFMDB_RX1B1_Msk		(0xFF << CANFD_AFMDB_RX1B1_Pos)

#define CANFD_AFMCR_RBF1DB1_Pos		1		//RX Buffer 1 data byte 1 filter mask enable
#define CANFD_AFMCR_RBF1DB1_Msk		(0x01 << CANFD_AFMCR_RBF1DB1_Pos)
#define CANFD_AFMCR_RBF1DB0_Pos		2		//RX Buffer 1 data byte 0 filter mask enable
#define CANFD_AFMCR_RBF1DB0_Msk		(0x01 << CANFD_AFMCR_RBF1DB0_Pos)
#define CANFD_AFMCR_RBF0DB1_Pos		3		//RX Buffer 0 data byte 1 filter mask enable
#define CANFD_AFMCR_RBF0DB1_Msk		(0x01 << CANFD_AFMCR_RBF0DB1_Pos)
#define CANFD_AFMCR_RBF0DB0_Pos		4		//RX Buffer 0 data byte 0 filter mask enable
#define CANFD_AFMCR_RBF0DB0_Msk		(0x01 << CANFD_AFMCR_RBF0DB0_Pos)
#define CANFD_AFMCR_RBF1ID_Pos		5		//RX Buffer 1 ID filter mask enable
#define CANFD_AFMCR_RBF1ID_Msk		(0x01 << CANFD_AFMCR_RBF1ID_Pos)
#define CANFD_AFMCR_RBF0ID_Pos		6		//RX Buffer 0 ID filter mask enable
#define CANFD_AFMCR_RBF0ID_Msk		(0x01 << CANFD_AFMCR_RBF0ID_Pos)
#define CANFD_AFMCR_ALL_Pos			7
#define CANFD_AFMCR_ALL_Msk			(0x01 << CANFD_AFMCR_ALL_Pos)

#define CANFD_NBT0_SJW_Pos			3
#define CANFD_NBT0_SJW_Msk			(0x1F << CANFD_NBT0_SJW_Pos)
#define CANFD_NBT0_BRP_Pos			8
#define CANFD_NBT0_BRP_Msk			(0xFF << CANFD_NBT0_BRP_Pos)
#define CANFD_NBT0_PROP_Pos			17
#define CANFD_NBT0_PROP_Msk			(0x3F << CANFD_NBT0_PROP_Pos)
#define CANFD_NBT0_SEG1_Pos			27
#define CANFD_NBT0_SEG1_Msk			(0x1Fu<< CANFD_NBT0_SEG1_Pos)

#define CANFD_NBT1_SEG2_Pos			3
#define CANFD_NBT1_SEG2_Msk			(0x1F << CANFD_NBT1_SEG2_Pos)

#define CANFD_DBT_BRP_Pos			0
#define CANFD_DBT_BRP_Msk			(0xFF << CANFD_DBT_BRP_Pos)
#define CANFD_DBT_SJW_Pos			9
#define CANFD_DBT_SJW_Msk			(0x03 << CANFD_DBT_SJW_Pos)
#define CANFD_DBT_PROP_Pos			11
#define CANFD_DBT_PROP_Msk			(0x0F << CANFD_DBT_PROP_Pos)
#define CANFD_DBT_SEG1_Pos			21
#define CANFD_DBT_SEG1_Msk			(0x07 << CANFD_DBT_SEG1_Pos)
#define CANFD_DBT_SEG2_Pos			29
#define CANFD_DBT_SEG2_Msk			(0x07u<< CANFD_DBT_SEG2_Pos)

#define CANFD_ERRCNT_RX_Pos			0
#define CANFD_ERRCNT_RX_Msk			(0xFFFF<< CANFD_ERRCNT_RX_Pos)
#define CANFD_ERRCNT_TX_Pos			16
#define CANFD_ERRCNT_TX_Msk			(0xFFFF<< CANFD_ERRCNT_TX_Pos)

#define CANFD_ERRSR_RXOV_Pos		2
#define CANFD_ERRSR_RXOV_Msk		(0x01 << CANFD_ERRSR_RXOV_Pos)
#define CANFD_ERRSR_ACK_Pos			3
#define CANFD_ERRSR_ACK_Msk			(0x01 << CANFD_ERRSR_ACK_Pos)
#define CANFD_ERRSR_FORM_Pos		4
#define CANFD_ERRSR_FORM_Msk		(0x01 << CANFD_ERRSR_FORM_Pos)
#define CANFD_ERRSR_CRC_Pos			5
#define CANFD_ERRSR_CRC_Msk			(0x01 << CANFD_ERRSR_CRC_Pos)
#define CANFD_ERRSR_STUFF_Pos		6
#define CANFD_ERRSR_STUFF_Msk		(0x01 << CANFD_ERRSR_STUFF_Pos)
#define CANFD_ERRSR_BIT_Pos			7
#define CANFD_ERRSR_BIT_Msk			(0x01 << CANFD_ERRSR_BIT_Pos)
#define CANFD_ERRSR_RXBF1_Pos		11		//RX buffer 1 receive error
#define CANFD_ERRSR_RXBF1_Msk		(0x01 << CANFD_ERRSR_RXBF1_Pos)
#define CANFD_ERRSR_RXBF0_Pos		12
#define CANFD_ERRSR_RXBF0_Msk		(0x01 << CANFD_ERRSR_RXBF0_Pos)
#define CANFD_ERRSR_TXBF2_Pos		13		//TX buffer 2 transmit error
#define CANFD_ERRSR_TXBF2_Msk		(0x01 << CANFD_ERRSR_TXBF2_Pos)
#define CANFD_ERRSR_TXBF1_Pos		14
#define CANFD_ERRSR_TXBF1_Msk		(0x01 << CANFD_ERRSR_TXBF1_Pos)
#define CANFD_ERRSR_TXBF0_Pos		15
#define CANFD_ERRSR_TXBF0_Msk		(0x01 << CANFD_ERRSR_TXBF0_Pos)

#define CANFD_RXTS_RXBF0_Pos		0		//RX Buffer 0 time stamp
#define CANFD_RXTS_RXBF0_Msk		(0xFFFF<< CANFD_RXTS_RXBF0_Pos)
#define CANFD_RXTS_RXBF1_Pos		16
#define CANFD_RXTS_RXBF1_Msk		(0xFFFF<< CANFD_RXTS_RXBF1_Pos)

#define CANFD_IF_RBF1OK_Pos			0		//RX buffer 1 received a frame successfully
#define CANFD_IF_RBF1OK_Msk			(0x01 << CANFD_IF_RBF1OK_Pos)
#define CANFD_IF_RBF0OK_Pos			1
#define CANFD_IF_RBF0OK_Msk			(0x01 << CANFD_IF_RBF0OK_Pos)
#define CANFD_IF_TBF2OK_Pos			2		//TX buffer 2 transmitted a frame successfully
#define CANFD_IF_TBF2OK_Msk			(0x01 << CANFD_IF_TBF2OK_Pos)
#define CANFD_IF_TBF1OK_Pos			3
#define CANFD_IF_TBF1OK_Msk			(0x01 << CANFD_IF_TBF1OK_Pos)
#define CANFD_IF_TBF0OK_Pos			4
#define CANFD_IF_TBF0OK_Msk			(0x01 << CANFD_IF_TBF0OK_Pos)
#define CANFD_IF_ERROR_Pos			5
#define CANFD_IF_ERROR_Msk			(0x01 << CANFD_IF_ERROR_Pos)
#define CANFD_IF_RXOV_Pos			6
#define CANFD_IF_RXOV_Msk			(0x01 << CANFD_IF_RXOV_Pos)
#define CANFD_IF_WKUP_Pos			7
#define CANFD_IF_WKUP_Msk			(0x01 << CANFD_IF_WKUP_Pos)




