Synwit-Co-Ltd/SWM342_Lib/SWM342_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM342.h
#define DCMI_CWSIZ_PIXEL_Pos		0		//number of pixel in line to be captured
#define DCMI_CWSIZ_PIXEL_Msk		(0x3FFF << DCMI_CWSIZ_PIXEL_Pos)
#define DCMI_CWSIZ_LINE_Pos			16		//number of line in frame to be captured
#define DCMI_CWSIZ_LINE_Msk			(0x1FFF << DCMI_CWSIZ_LINE_Pos)




typedef struct {
	__IO uint32_t IF;						//[0] 数据传输结束时置位，写1清零
	
	__IO uint32_t IE;

		 uint32_t RESERVED;
    
    __IO uint32_t START;
    
    __IO uint32_t RESERVED2;
    
    __IO uint32_t CR;
	    
    __IO uint32_t CRH0;
	
	__IO uint32_t CRH1;
		
	__IO uint32_t CRV0;
	
	__IO uint32_t CRV1;
		
	__IO uint32_t BGC;						//Background color
	
		 uint32_t RESERVED4[5];
	
	struct {
		__IO uint32_t LCR;					//Layer Control Register
		
		__IO uint32_t WHP;					//Window Horizon Position
		
		__IO uint32_t WVP;					//Window Vertical Position
		
		__IO uint32_t ADDR;					//display data Address
		
		__IO uint32_t LLEN;					//display data Line Length
		
		__IO uint32_t CK;					//Color Key
		
			 uint32_t RESERVED5[10];
	} L[2];									//Layer
	
		 uint32_t RESERVED5[16];
	
		__IO uint32_t MPUCR;
	
		__IO uint32_t MPUIR;
	
		__IO uint32_t MPUDR;
	
		__IO uint32_t MPUAR;
	
		__IO uint32_t MPULEN;
} LCD_TypeDef;


#define LCD_START_GO_Pos			1		//写1开始传输数据，数据传输结束后自动清零
#define LCD_START_GO_Msk			(0x01 << LCD_START_GO_Pos)

#define LCD_CR_CLKDIV_Pos			0      	//DOTCLK相对于模块时钟的分频比，0表示2分频，1表示3分频 ...
#define LCD_CR_CLKDIV_Msk			(0x3F << LCD_CR_CLKDIV_Pos)
#define LCD_CR_CLKINV_Pos			6      	//1 输出DOTCLK反向，用于DOTCLK下降沿采样数据的屏
#define LCD_CR_CLKINV_Msk			(0x01 << LCD_CR_CLKINV_Pos)
#define LCD_CR_CLKALW_Pos			7		//DOTCLK Always，1 DOTCLK一直翻转    0 DOTCLK在空闲时停在1
#define LCD_CR_CLKALW_Msk			(0x01 << LCD_CR_CLKALW_Pos)
#define LCD_CR_BURSTLEN_Pos			8		//Burst Length，0 Single   1 Burst INCR4   2 Burst INCR8   3 Burst INCR16
#define LCD_CR_BURSTLEN_Msk			(0x03 << LCD_CR_BURSTLEN_Pos)
#define LCD_CR_AUTORESTA_Pos		13		//Auto Restart，1 刷新完一帧后自动重启刷新
#define LCD_CR_AUTORESTA_Msk		(0x01 << LCD_CR_AUTORESTA_Pos)
#define LCD_CR_IMMRELOAD_Pos		14		//Immediate Reload，立即将层配置寄存器的值加载到层工作寄存器
#define LCD_CR_IMMRELOAD_Msk		(0x01 << LCD_CR_IMMRELOAD_Pos)
#define LCD_CR_VBPRELOAD_Pos		15		//VBP Period Relaod
#define LCD_CR_VBPRELOAD_Msk		(0x01 << LCD_CR_VBPRELOAD_Pos)
#define LCD_CR_FORMAT_Pos			16		//0 RGB565    1 RGB888
#define LCD_CR_FORMAT_Msk			(0x01 << LCD_CR_FORMAT_Pos)
#define LCD_CR_SEREN_Pos			17		//Serial RGB Enable
#define LCD_CR_SEREN_Msk			(0x01 << LCD_CR_SEREN_Pos)
#define LCD_CR_MPUEN_Pos			18		//MPU Interface Enable
#define LCD_CR_MPUEN_Msk			(0x01 << LCD_CR_MPUEN_Pos)
#define LCD_CR_VSYNCINV_Pos			19		//1 VSYNC反相输出
#define LCD_CR_VSYNCINV_Msk			(0x01 << LCD_CR_VSYNCINV_Pos)
#define LCD_CR_HSYNCINV_Pos			20		//1 HSYNC反相输出
#define LCD_CR_HSYNCINV_Msk			(0x01 << LCD_CR_HSYNCINV_Pos)

#define LCD_CRH0_HSW_Pos			0		//Hsync Width, 输出HSYNC低电平持续多少个DOTCLK周期，0表示1个周期
#define LCD_CRH0_HSW_Msk			(0x1FF<< LCD_CRH0_HSW_Pos)
#define LCD_CRH0_HBP_Pos			10		//0表示1个DOTCLK周期
#define LCD_CRH0_HBP_Msk			(0x1FF<< LCD_CRH0_HBP_Pos)
#define LCD_CRH0_HFP_Pos			20		//0表示1个DOTCLK周期
#define LCD_CRH0_HFP_Msk			(0x1FF<< LCD_CRH0_HFP_Pos)

#define LCD_CRH1_PIX_Pos			0		//水平方向的像素个数，0表示1个，最大为8191
#define LCD_CRH1_PIX_Msk			(0x1FFF<< LCD_CRH1_PIX_Pos)

#define LCD_CRV0_VSW_Pos			0		//Vsync Width，输出VSYNC低电平持续多少个行周期，0表示1个周期
#define LCD_CRV0_VSW_Msk			(0x1FF<< LCD_CRV0_VSW_Pos)
#define LCD_CRV0_VBP_Pos			10		//0表示1个水平行周期
#define LCD_CRV0_VBP_Msk			(0x1FF<< LCD_CRV0_VBP_Pos)
#define LCD_CRV0_VFP_Pos			20		//0表示1个水平行周期
#define LCD_CRV0_VFP_Msk			(0x1FF<< LCD_CRV0_VFP_Pos)

#define LCD_CRV1_PIX_Pos			0		//垂直方向的像素个数，0表示1个，最大为8191
#define LCD_CRV1_PIX_Msk			(0x1FFF<< LCD_CRV1_PIX_Pos)

#define LCD_LCR_ALPHA_Pos			0		//Blend时该层的Alpha值
#define LCD_LCR_ALPHA_Msk			(0xFF << LCD_LCR_ALPHA_Pos)
#define LCD_LCR_EN_Pos				8		//Layer Enable
#define LCD_LCR_EN_Msk				(0x01 << LCD_LCR_EN_Pos)
#define LCD_LCR_CKEN_Pos			9		//Layer Color Key Enable
#define LCD_LCR_CKEN_Msk			(0x01 << LCD_LCR_CKEN_Pos)

#define LCD_WHP_STA_Pos				0		//Layer Window 水平起始点
#define LCD_WHP_STA_Msk				(0x3FF<< LCD_WHP_STA_Pos)
#define LCD_WHP_STP_Pos				16		//Layer Window 水平结束点
#define LCD_WHP_STP_Msk				(0x3FF<< LCD_WHP_STP_Pos)

#define LCD_WVP_STA_Pos				0		//Layer Window 竖直起始点
#define LCD_WVP_STA_Msk				(0x3FF<< LCD_WVP_STA_Pos)
#define LCD_WVP_STP_Pos				16		//Layer Window 竖直结束点
#define LCD_WVP_STP_Msk				(0x3FF<< LCD_WVP_STP_Pos)

#define LCD_MPUCR_RCS1_0_Pos		0		//读操作时，CS上升沿到下降沿时间间隔，0  1个时钟中期
#define LCD_MPUCR_RCS1_0_Msk		(0x1F << LCD_MPUCR_RCS1_0_Pos)
#define LCD_MPUCR_RDHOLD_Pos		5		//RD低电平保持时间
#define LCD_MPUCR_RDHOLD_Msk		(0x1F << LCD_MPUCR_RDHOLD_Pos)
#define LCD_MPUCR_WCS1_0_Pos		10		//写操作时，CS上升沿到下降沿时间间隔
#define LCD_MPUCR_WCS1_0_Msk		(0x0F << LCD_MPUCR_WCS1_0_Pos)
#define LCD_MPUCR_WR1CS1_Pos		14		//WR上升沿到CS上升沿延时
#define LCD_MPUCR_WR1CS1_Msk		(0x03 << LCD_MPUCR_WR1CS1_Pos)
#define LCD_MPUCR_WRHOLD_Pos		16		//WR低电平保持时间
#define LCD_MPUCR_WRHOLD_Msk		(0x0F << LCD_MPUCR_WRHOLD_Pos)
#define LCD_MPUCR_CS0WR0_Pos		20		//CS下降沿到WR下降沿延时
#define LCD_MPUCR_CS0WR0_Msk		(0x03 << LCD_MPUCR_CS0WR0_Pos)

#define LCD_MPULEN_VPIX_Pos			0		//行数，0表示1行
#define LCD_MPULEN_VPIX_Msk			(0x3FF<< LCD_MPULEN_VPIX_Pos)
#define LCD_MPULEN_HPIX_Pos			16		//每行像素数，0表示1个像素，只能赋奇数值，保证偶数个像素
#define LCD_MPULEN_HPIX_Msk			(0x3FF<< LCD_MPULEN_HPIX_Pos)




typedef struct {
	__IO uint32_t IF;
	
	__IO uint32_t IE;
	
	__IO uint32_t CR;
	
		 uint32_t RESERVED;
	
	struct {
		__IO uint32_t MAR;					//Memory Address Register，word对齐（低两位固定为0）
		
		__IO uint32_t OR;					//Offset Register, added at the end of each line to determine the starting address of the next line
		
		__IO uint32_t PFCCR;				//Pixel Format Converter Control Register
		
		__IO uint32_t COLOR;
	} L[3];									//Layer: 0 Foreground   1 Background   2 Output
	
	__IO uint32_t NLR;						//Number of Line Register
	
	__IO uint32_t AAR;						//Alpha Address，Foreground Layer 的 Alpha 值存储地址
} DMA2D_TypeDef;


