Synwit-Co-Ltd/SWM342_Lib/SWM342_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM342.h
#define DMA2D_IF_DONE_Pos			1		//传输完成，写1清零
#define DMA2D_IF_DONE_Msk			(0x01 << DMA2D_IF_DONE_Pos)

#define DMA2D_IE_DONE_Pos			1
#define DMA2D_IE_DONE_Msk			(0x01 << DMA2D_IE_DONE_Pos)

#define DMA2D_CR_START_Pos			0		//开始传输
#define DMA2D_CR_START_Msk			(0x01 << DMA2D_CR_START_Pos)
#define DMA2D_CR_BURST_Pos			3		//0 Incr16   1 Incr8   2 Incr4   3 Single
#define DMA2D_CR_BURST_Msk			(0x03 << DMA2D_CR_BURST_Pos)
#define DMA2D_CR_MODE_Pos			8		//0 存储器到存储器   1 存储器到存储器并执行PFC   2 存储器到存储器并执行混合   3 寄存器到存储器（仅输出阶段激合）
#define DMA2D_CR_MODE_Msk			(0x03 << DMA2D_CR_MODE_Pos)
#define DMA2D_CR_AAREN_Pos			10		//1 前景层的 Alpha 值存储在 AAR 指定的地址处
#define DMA2D_CR_AAREN_Msk			(0x01 << DMA2D_CR_AAREN_Pos)
#define DMA2D_CR_BLKSZ_Pos			14		//Block Size，DMA2D 每搬运 BLKSZ 个字，可以插入 WAIT 个等待时钟周期，0 16   1 32   2 64   3 128
#define DMA2D_CR_BLKSZ_Msk			(0x03 << DMA2D_CR_BLKSZ_Pos)
#define DMA2D_CR_WAIT_Pos			16		//每传输一块数据，等待指定个系统周期后再传输下一个块，防止DMA2D占用过多SDRAM带宽，影响LCD读取显示数据
#define DMA2D_CR_WAIT_Msk			(0xFFFFu<<DMA2D_CR_WAIT_Pos)

#define DMA2D_PFCCR_CFMT_Pos		0		//Color Format, 0 ARGB8888   1 RGB8888   2 RGB565
#define DMA2D_PFCCR_CFMT_Msk		(0x07 << DMA2D_CFMT_FORMAT_Pos)
#define DMA2D_PFCCR_AINV_Pos		3		//Alpha Invert（按位取反）
#define DMA2D_PFCCR_AINV_Msk		(0x01 << DMA2D_PFCCR_AINV_Pos)
#define DMA2D_PFCCR_RBSWAP_Pos		4		//RB Swap, 0 RGB   1 BGR
#define DMA2D_PFCCR_RBSWAP_Msk		(0x01 << DMA2D_PFCCR_RBSWAP_Pos)
#define DMA2D_PFCCR_AMODE_Pos		8		//Alpha Mode, 0 使用像素点自带Alpha值   1 使用PFCCR.ALPHA值   2 使用像素点自带Alpha值与PFCCR.ALPHA值的乘积
#define DMA2D_PFCCR_AMODE_Msk		(0x03 << DMA2D_PFCCR_AMODE_Pos)
#define DMA2D_PFCCR_ALPHA_Pos		24
#define DMA2D_PFCCR_ALPHA_Msk		(0xFFu<< DMA2D_PFCCR_ALPHA_Pos)

#define DMA2D_NLR_NLINE_Pos			0		//Number of Line
#define DMA2D_NLR_NLINE_Msk			(0xFFFF<<DMA2D_NLR_NLINE_Pos)
#define DMA2D_NLR_NPIXEL_Pos		16		//Number of Pixel per line
#define DMA2D_NLR_NPIXEL_Msk		(0x3FFF<<DMA2D_NLR_NPIXEL_Pos)




typedef struct {
	__O  uint32_t CR;
	
	__I  uint32_t SR;
	
	union {
		__IO uint32_t IFE;					//Interrupt Flag Enable
	
		__IO uint32_t IE;
	};
	
	__IO uint32_t IF;
	
	__IO uint32_t CFG;
	
	__IO uint32_t SINP;						//Scaling & Sin parameter
	__IO uint32_t COSP;						//Scaling & Cos parameter
	
	__IO uint32_t SRC_TILE_POSX;
	__IO uint32_t SRC_TILE_POSY;
	__IO uint32_t DST_TILE_OFFX;			//Offset
	__IO uint32_t DST_TILE_OFFY;
	
	__IO uint32_t BGCOLOR;
	
	__IO uint32_t SRCBASE;
	__IO uint32_t SRCSIZE;
	__IO uint32_t SRCSTRIDE;
	
	__IO uint32_t DSTBASE;
	__IO uint32_t DSTSIZE;
	__IO uint32_t DSTSTRIDE;
} SRA_TypeDef;


#define SRA_CR_START_Pos			0
#define SRA_CR_START_Msk			(0x01 << SRA_CR_START_Pos)
#define SRA_CR_ABORT_Pos			1
#define SRA_CR_ABORT_Msk			(0x01 << SRA_CR_ABORT_Pos)

#define SRA_SR_BUSY_Pos				0
#define SRA_SR_BUSY_Msk				(0x01 << SRA_SR_BUSY_Pos)
#define SRA_SR_ABORT_Pos			1		//1 Abort pending
#define SRA_SR_ABORT_Msk			(0x01 << SRA_SR_ABORT_Pos)

#define SRA_IFE_FRAME_Pos			0
#define SRA_IFE_FRAME_Msk			(0x01 << SRA_IFE_FRAME_Pos)
#define SRA_IFE_8LINE_Pos			1
#define SRA_IFE_8LINE_Msk			(0x01 << SRA_IFE_8LINE_Pos)
#define SRA_IFE_ROTERR_Pos			2
#define SRA_IFE_ROTERR_Msk			(0x01 << SRA_IFE_ROTERR_Pos)
#define SRA_IFE_BUSERR_Pos			3
#define SRA_IFE_BUSERR_Msk			(0x01 << SRA_IFE_BUSERR_Pos)

#define SRA_IE_FRAME_Pos			4
#define SRA_IE_FRAME_Msk			(0x01 << SRA_IE_FRAME_Pos)
#define SRA_IE_8LINE_Pos			5
#define SRA_IE_8LINE_Msk			(0x01 << SRA_IE_8LINE_Pos)
#define SRA_IE_ROTERR_Pos			6
#define SRA_IE_ROTERR_Msk			(0x01 << SRA_IE_ROTERR_Pos)
#define SRA_IE_BUSERR_Pos			7
#define SRA_IE_BUSERR_Msk			(0x01 << SRA_IE_BUSERR_Pos)

#define SRA_IF_FRAME_Pos			0
#define SRA_IF_FRAME_Msk			(0x01 << SRA_IF_FRAME_Pos)
#define SRA_IF_8LINE_Pos			1
#define SRA_IF_8LINE_Msk			(0x01 << SRA_IF_8LINE_Pos)
#define SRA_IF_ROTERR_Pos			2
#define SRA_IF_ROTERR_Msk			(0x01 << SRA_IF_ROTERR_Pos)
#define SRA_IF_BUSERR_Pos			3
#define SRA_IF_BUSERR_Msk			(0x01 << SRA_IF_BUSERR_Pos)

#define SRA_CFG_PIXFMT_Pos			0		//Pixel Format, 0 Monochrome 8-bit   1 RGB565   2 RGB888   3 RGB888X
#define SRA_CFG_PIXFMT_Msk			(0x03 << SRA_CFG_PIXFMT_Pos)
#define SRA_CFG_ROTTYP_Pos			2		//Rotation Type, 0 normal rotation   1 x-mirror   2 y-mirror   3 x-mirror + y-mirror
#define SRA_CFG_ROTTYP_Msk			(0x03 << SRA_CFG_ROTTYP_Pos)
#define SRA_CFG_RBSWAP_Pos			4		//R/B swap, 0 RGB   1 BGR
#define SRA_CFG_RBSWAP_Msk			(0x01 << SRA_CFG_RBSWAP_Pos)
#define SRA_CFG_SXSWAP_Pos			5		//SRC X swap, 0 XRGB   1 RGBX
#define SRA_CFG_SXSWAP_Msk			(0x01 << SRA_CFG_SXSWAP_Pos)
#define SRA_CFG_DXSWAP_Pos			6		//DST X swap, 0 XRGB   1 RGBX
#define SRA_CFG_DXSWAP_Msk			(0x01 << SRA_CFG_DXSWAP_Pos)
#define SRA_CFG_ROTAAEN_Pos			7		//Rotation Anti-aliasing enable
#define SRA_CFG_ROTAAEN_Msk			(0x01 << SRA_CFG_ROTAAEN_Pos)
#define SRA_CFG_DUMMYBP_Pos			8		//Dummy tile bypass, 0 write back   1 bypass
#define SRA_CFG_DUMMYBP_Msk			(0x01 << SRA_CFG_DUMMYBP_Pos)

#define SRA_SINP_SINX_Pos			0		//sin(θ) * X scaling factor
#define SRA_SINP_SINX_Msk			(0xFFFF << SRA_SINP_SINX_Pos)
#define SRA_SINP_SINY_Pos			16		//sin(θ) * Y scaling factor
#define SRA_SINP_SINY_Msk			(0xFFFFu<< SRA_SINP_SINY_Pos)

#define SRA_COSP_COSX_Pos			0		//cos(θ) * X scaling factor
#define SRA_COSP_COSX_Msk			(0xFFFF << SRA_COSP_COSX_Pos)
#define SRA_COSP_COSY_Pos			16		//cos(θ) * Y scaling factor
#define SRA_COSP_COSY_Msk			(0xFFFFu<< SRA_COSP_COSY_Pos)

#define SRA_SRCSIZE_WIDTH_Pos		0
#define SRA_SRCSIZE_WIDTH_Msk		(0x7FFF << SRA_SRCSIZE_WIDTH_Pos)
#define SRA_SRCSIZE_HEIGHT_Pos		16
#define SRA_SRCSIZE_HEIGHT_Msk		(0x7FFF << SRA_SRCSIZE_HEIGHT_Pos)

#define SRA_DSTSIZE_WIDTH_Pos		0
#define SRA_DSTSIZE_WIDTH_Msk		(0x7FFF << SRA_DSTSIZE_WIDTH_Pos)
#define SRA_DSTSIZE_HEIGHT_Pos		16
#define SRA_DSTSIZE_HEIGHT_Msk		(0x7FFF << SRA_DSTSIZE_HEIGHT_Pos)




typedef struct {
    __IO uint32_t CR;
	
	__IO uint32_t T64;						//64ms刷新周期配置
    
    __IO uint32_t TIM;
    
