Synwit-Co-Ltd/SWM342_Lib/SWM342_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM342.h
typedef struct {
	__IO uint32_t DATA;
	
	__IO uint32_t ADDR;
	
	__IO uint32_t ERASE;
	
	__IO uint32_t CACHE;
	
	__IO uint32_t CFG0;
	
	__IO uint32_t CFG1;
	
	__IO uint32_t CFG2;
	
	__IO uint32_t CFG3;
	
	__IO uint32_t CFG4;
	
	__IO uint32_t STAT;
} FMC_TypeDef;


#define FMC_ERASE_ADDR_Pos			0		//4K每页
#define FMC_ERASE_ADDR_Msk			(0x7FFFF << FMC_ERASE_ADDR_Pos)
#define FMC_ERASE_REQ_Pos			27
#define FMC_ERASE_REQ_Msk			(0x1Fu<< FMC_ERASE_REQ_Pos)

#define FMC_CACHE_PROGEN_Pos		0		//Flash Program Enable
#define FMC_CACHE_PROGEN_Msk		(0x01 << FMC_CACHE_PROGEN_Pos)
#define FMC_CACHE_CEN_Pos			16		//Cache Enable
#define FMC_CACHE_CEN_Msk			(0x01 << FMC_CACHE_CEN_Pos)
#define FMC_CACHE_CPEN_Pos			17		//Cache Predict Enable
#define FMC_CACHE_CPEN_Msk			(0x01 << FMC_CACHE_CPEN_Pos)
#define FMC_CACHE_CCLR_Pos			18		//Cache Clear，自动清零
#define FMC_CACHE_CCLR_Msk			(0x01 << FMC_CACHE_CCLR_Pos)

#define FMC_STAT_ERASEBUSY_Pos		0
#define FMC_STAT_ERASEBUSY_Msk		(0x01 << FMC_STAT_ERASEBUSY_Pos)
#define FMC_STAT_PROGBUSY_Pos		1
#define FMC_STAT_PROGBUSY_Msk		(0x01 << FMC_STAT_PROGBUSY_Pos)
#define FMC_STAT_READBUSY_Pos		2
#define FMC_STAT_READBUSY_Msk		(0x01 << FMC_STAT_READBUSY_Pos)
#define FMC_STAT_FIFOEMPTY_Pos		3		//Write FIFO Empty
#define FMC_STAT_FIFOEMPTY_Msk		(0x01 << FMC_STAT_FIFOEMPTY_Pos)
#define FMC_STAT_FIFOFULL_Pos		4		//Write FIFO Full
#define FMC_STAT_FIFOFULL_Msk		(0x01 << FMC_STAT_FIFOFULL_Pos)
#define FMC_STAT_IDLE_Pos			31
#define FMC_STAT_IDLE_Msk			(0x01u<< FMC_STAT_IDLE_Pos)




typedef struct {
	__IO uint32_t CFG;
	__IO uint32_t TIM;
	__I  uint32_t SR;
	__IO uint32_t IF;
	__IO uint32_t IE;
	__IO uint32_t GO;
	__IO uint32_t ADDR;
	__IO uint32_t DATA;
	__IO uint32_t CMDAHB;					//通过AHB总线读写Flash时使用的命令码
	__IO uint32_t CMD;						//通过寄存器 读写Flash时使用的命令码
} SFC_TypeDef;								//Serial Flash Controller


#define SFC_CFG_CMDTYPE_Pos			0		//0 无地址、无数据、无WIP，用于写使能、写禁止
											//1 无地址、有数据（读1字节）、无WIP，用于读状态寄存器高8位、读状态寄存器低8位
											//2 无地址、有数据（读3字节）、无WIP，用于读Identification
											//3 有地址、有数据（读2字节）、无WIP，用于读MID、读DID
											//4 无地址、无数据、有WIP
											//5 无地址、无数据、有WIP（自动写使能），用于片擦
											//6 无地址、有数据（写2字节）、有WIP（自动写使能），用于写16位状态寄存器
											//7 有地址、无数据、有WIP（自动写使能），用于扇区擦
#define SFC_CFG_CMDTYPE_Msk			(0x0F << SFC_CFG_CMDTYPE_Pos)
#define SFC_CFG_CMDWREN_Pos			5		//SFC->CMD寄存器写使能，使能后可将命令码写入CMD寄存器
#define SFC_CFG_CMDWREN_Msk			(0x01 << SFC_CFG_CMDWREN_Pos)
#define SFC_CFG_CLKDIV_Pos			6		//时钟分频：0 1分频   1 2分频   2 4分频   3 8分频
#define SFC_CFG_CLKDIV_Msk			(0x03 << SFC_CFG_CLKDIV_Pos)
#define SFC_CFG_ADDR4L_Pos			8		//编程操作的地址阶段使用4条数据线
#define SFC_CFG_ADDR4L_Msk			(0x01 << SFC_CFG_ADDR4L_Pos)
#define SFC_CFG_DATA4L_PP_Pos		9		//编程操作的数据阶段使用4条数据线
#define SFC_CFG_DATA4L_PP_Msk		(0x01 << SFC_CFG_DATA4L_PP_Pos)
#define SFC_CFG_DATA4L_RD_Pos		10		//读取操作的地址阶段和数据阶段使用：0 1条数据线   1 2条数据线   2 4条数据线
#define SFC_CFG_DATA4L_RD_Msk		(0x03 << SFC_CFG_DATA4L_RD_Pos)
#define SFC_CFG_WREN_Pos			12		//Flash写使能
#define SFC_CFG_WREN_Msk			(0x01 << SFC_CFG_WREN_Pos)

#define SFC_TIM_WIP_CHK_ITV_Pos		0		//硬件自动查询WIP时间间隔
#define SFC_TIM_WIP_CHK_ITV_Msk		(0xFF << SFC_TIM_WIP_CHK_ITV_Pos)
#define SFC_TIM_WIP_CHK_LMT_Pos		8		//硬件自动查询WIP次数限值
#define SFC_TIM_WIP_CHK_LMT_Msk		(0xFF << SFC_TIM_WIP_CHK_LMT_Pos)
#define SFC_TIM_IDLETO_Pos			16		//空闲超时，超时后释放CS
#define SFC_TIM_IDLETO_Msk			(0x3F << SFC_TIM_IDLETO_Pos)
#define SFC_TIM_CSHIGH_Pos			22		//CS拉高最短时间：0 1个SCLK时钟周期   1 2个   2 3个   3 4个
#define SFC_TIM_CSHIGH_Msk			(0x03 << SFC_TIM_CSHIGH_Pos)

#define SFC_SR_BUSY_Pos				0
#define SFC_SR_BUSY_Msk				(0x01 << SFC_SR_BUSY_Pos)

#define SFC_IF_OVER_Pos				0		//操作结束，写1清零
#define SFC_IF_OVER_Msk				(0x01 << SFC_IF_OVER_Pos)
#define SFC_IF_ERR_Pos				1		//Error
#define SFC_IF_ERR_Msk				(0x01 << SFC_IF_ERR_Pos)
#define SFC_IF_TO_Pos				2		//Timeout
#define SFC_IF_TO_Msk				(0x01 << SFC_IF_TO_Pos)

#define SFC_IE_OVER_Pos				0		//操作结束
#define SFC_IE_OVER_Msk				(0x01 << SFC_IE_OVER_Pos)
#define SFC_IE_ERR_Pos				1
#define SFC_IE_ERR_Msk				(0x01 << SFC_IE_ERR_Pos)
#define SFC_IE_TO_Pos				2		//Timeout
#define SFC_IE_TO_Msk 				(0x01 << SFC_IE_TO_Pos)

#define SFC_GO_START_Pos			0		//除Flash memory读、写以外的外置Flash命令启动
#define SFC_GO_START_Msk			(0x01 << SFC_GO_START_Pos)

#define SFC_CMDAHB_WREN_Pos			0		//Flash命令码：写使能
#define SFC_CMDAHB_WREN_Msk			(0xFF << SFC_CMDAHB_WREN_Pos)
#define SFC_CMDAHB_PP_Pos			8		//Flash命令码：页编程
#define SFC_CMDAHB_PP_Msk			(0xFF << SFC_CMDAHB_PP_Pos)
#define SFC_CMDAHB_RDSRL_Pos		16		//Flash命令码：读STATUS REG低8位
#define SFC_CMDAHB_RDSRL_Msk		(0xFF << SFC_CMDAHB_RDSRL_Pos)
#define SFC_CMDAHB_READ_Pos			24		//Flash命令码：读数据
#define SFC_CMDAHB_READ_Msk			(0xFFu<< SFC_CMDAHB_READ_Pos)




typedef struct {
	__IO uint32_t CR;
	
	__IO uint32_t PREFCR;					//Prefetch Control Register
	
	__IO uint32_t IE;
	
	__IO uint32_t LOCKLMT;					//LOCK Limit，当LOCKCNT > LOCKLMT时触发中断，中断处理函数需要执行CACHE->CR.RST = 1复位CACHE
	
	__I  uint32_t LOCKCNT;
		
	__I  uint32_t CURLINE;					//Current Line，当前正在填充的SLOT编号
		
	__I  uint32_t ACCESSCNT;				//CPU访问Cache次数
	
	__I  uint32_t HITCNT;					//CPU访问Cache命中次数
	
	__IO uint32_t IF;
} CACHEC_TypeDef;


#define CACHEC_CR_RST_Pos			0		//复位Cache，只能在IDLE时置位
#define CACHEC_CR_RST_Msk			(0x01 << CACHEC_CR_RST_Pos)
#define CACHEC_CR_ALG_Pos			1		//0 LRU替换   1 随机替换
#define CACHEC_CR_ALG_Msk			(0x01 << CACHEC_CR_ALG_Pos)
#define CACHEC_CR_IDLE_Pos			2
#define CACHEC_CR_IDLE_Msk			(0x01 << CACHEC_CR_IDLE_Pos)

#define CACHEC_PREFCR_UNLOCK_Pos	0		//预取的地址由此操作释放
#define CACHEC_PREFCR_UNLOCK_Msk	(0x01 << CACHEC_PREFCR_UNLOCK_Pos)
#define CACHEC_PREFCR_PREFET_Pos	1		//预取并锁定指定地址的内容
#define CACHEC_PREFCR_PREFET_Msk	(0x01 << CACHEC_PREFCR_PREFET_Pos)
#define CACHEC_PREFCR_ADDR_Pos		2
#define CACHEC_PREFCR_ADDR_Msk		(0xFFFFFF << CACHEC_PREFCR_ADDR_Pos)
#define CACHEC_PREFCR_RDY_Pos		31		//只有在此位为1时才能执行PREFET、UNLOCK操作
#define CACHEC_PREFCR_RDY_Msk		(0x01u<< CACHEC_PREFCR_RDY_Pos)

#define CACHEC_IE_EN_Pos			0		//模块总中断使能
#define CACHEC_IE_EN_Msk			(0x01 << CACHEC_IE_EN_Pos)
#define CACHEC_IE_PREFET_Pos		1		//PREFET中断使能，只有中断使能时相应中断状态才能置起
#define CACHEC_IE_PREFET_Msk		(0x01 << CACHEC_IE_PREFET_Pos)
#define CACHEC_IE_UNLOCK_Pos		2		//UNLOCK中断使能
#define CACHEC_IE_UNLOCK_Msk		(0x01 << CACHEC_IE_UNLOCK_Pos)
#define CACHEC_IE_LOCKLMT_Pos		3		//LOCK数量达到LOCKLMT的限制中断使能
#define CACHEC_IE_LOCKLMT_Msk		(0x01 << CACHEC_IE_LOCKLMT_Pos)

#define CACHEC_IF_PREOK_Pos			0		//Prefetch OK，写1清零
#define CACHEC_IF_PREOK_Msk			(0x01 << CACHEC_IF_PREOK_Pos)
#define CACHEC_IF_PREFAIL_Pos		1		//Prefetch Fail
#define CACHEC_IF_PREFAIL_Msk		(0x01 << CACHEC_IF_PREFAIL_Pos)
#define CACHEC_IF_UNLOK_Pos			2		//Unlock OK
#define CACHEC_IF_UNLOK_Msk			(0x01 << CACHEC_IF_UNLOK_Pos)
#define CACHEC_IF_UNLFAIL_Pos		3		//Unlock Fail
#define CACHEC_IF_UNLFAIL_Msk		(0x01 << CACHEC_IF_UNLFAIL_Pos)
#define CACHEC_IF_LOCKLMT_Pos		4		//LOCK数量达到LOCKLMT
#define CACHEC_IF_LOCKLMT_Msk		(0x01 << CACHEC_IF_LOCKLMT_Pos)




