Synwit-Co-Ltd/SWM342_Lib/SWM342_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM342.h
#define USBD_EPIF_INEP0_Pos			0		//data sent or NAK sent
#define USBD_EPIF_INEP0_Msk			(0x01 << USBD_EPIF_INEP0_Pos)
#define USBD_EPIF_INEP1_Pos			1
#define USBD_EPIF_INEP1_Msk			(0x01 << USBD_EPIF_INEP1_Pos)
#define USBD_EPIF_INEP2_Pos			2
#define USBD_EPIF_INEP2_Msk			(0x01 << USBD_EPIF_INEP2_Pos)
#define USBD_EPIF_INEP3_Pos			3
#define USBD_EPIF_INEP3_Msk			(0x01 << USBD_EPIF_INEP3_Pos)
#define USBD_EPIF_INEP4_Pos			4
#define USBD_EPIF_INEP4_Msk			(0x01 << USBD_EPIF_INEP4_Pos)
#define USBD_EPIF_INEP5_Pos			5
#define USBD_EPIF_INEP5_Msk			(0x01 << USBD_EPIF_INEP5_Pos)
#define USBD_EPIF_INEP6_Pos			6
#define USBD_EPIF_INEP6_Msk			(0x01 << USBD_EPIF_INEP6_Pos)
#define USBD_EPIF_INEP7_Pos			7
#define USBD_EPIF_INEP7_Msk			(0x01 << USBD_EPIF_INEP7_Pos)
#define USBD_EPIF_OUTEP0_Pos		16		//data available
#define USBD_EPIF_OUTEP0_Msk		(0x01 << USBD_EPIF_OUTEP0_Pos)
#define USBD_EPIF_OUTEP1_Pos		17
#define USBD_EPIF_OUTEP1_Msk		(0x01 << USBD_EPIF_OUTEP1_Pos)
#define USBD_EPIF_OUTEP2_Pos		18
#define USBD_EPIF_OUTEP2_Msk		(0x01 << USBD_EPIF_OUTEP2_Pos)
#define USBD_EPIF_OUTEP3_Pos		19
#define USBD_EPIF_OUTEP3_Msk		(0x01 << USBD_EPIF_OUTEP3_Pos)
#define USBD_EPIF_OUTEP4_Pos		20
#define USBD_EPIF_OUTEP4_Msk		(0x01 << USBD_EPIF_OUTEP4_Pos)
#define USBD_EPIF_OUTEP5_Pos		21
#define USBD_EPIF_OUTEP5_Msk		(0x01 << USBD_EPIF_OUTEP5_Pos)
#define USBD_EPIF_OUTEP6_Pos		22
#define USBD_EPIF_OUTEP6_Msk		(0x01 << USBD_EPIF_OUTEP6_Pos)
#define USBD_EPIF_OUTEP7_Pos		23
#define USBD_EPIF_OUTEP7_Msk		(0x01 << USBD_EPIF_OUTEP7_Pos)

#define USBD_EPCFG_EPNR_Pos			0		//Endpoint Number
#define USBD_EPCFG_EPNR_Msk			(0x0F << USBD_EPCFG_EPNR_Pos)
#define USBD_EPCFG_DIR_Pos			4		//Endpoint Direction，0 OUT   1 IN
#define USBD_EPCFG_DIR_Msk			(0x01 << USBD_EPCFG_DIR_Pos)
#define USBD_EPCFG_TYPE_Pos			5		//Endpoint Type，0 Control   1  Isochronous   2 Bulk   3 Interrupt
#define USBD_EPCFG_TYPE_Msk			(0x03 << USBD_EPCFG_TYPE_Pos)
#define USBD_EPCFG_CFG_Pos			7		//Configuration number to which this endpoint belongs
#define USBD_EPCFG_CFG_Msk			(0x0F << USBD_EPCFG_CFG_Pos)
#define USBD_EPCFG_INTF_Pos			11		//Interface number to which this endpoint belongs
#define USBD_EPCFG_INTF_Msk			(0x0F << USBD_EPCFG_INTF_Pos)
#define USBD_EPCFG_ALT_Pos			15		//Alternate setting to which this endpoint belongs
#define USBD_EPCFG_ALT_Msk			(0x0F << USBD_EPCFG_ALT_Pos)
#define USBD_EPCFG_PKSZ_Pos			19		//Maximum packet size
#define USBD_EPCFG_PKSZ_Msk			(0xFF << USBD_EPCFG_PKSZ_Pos)




typedef struct {
	__IO uint32_t TXBUF[0x100];
	
		 uint32_t RESERVED1[15][0x100];		//0x4000, 16KB
	
	__IO uint32_t RXBUF[0x100];
	
		 uint32_t RESERVED2[0x200];			//0x4C00
	
	__IO uint32_t IF;						//Interrupt Flag
	
	__IO uint32_t IE;						//Interrupt Enable
	
	__IO uint32_t SR;						//Status Register
	
	__IO uint32_t CR;						//Control Register
	
	__IO uint32_t FFSZ;						//FIFO Size
	
	__IO uint32_t FFTHR;					//FIFO Threshold
	
	__IO uint32_t TXTRSZ;					//Tx Transfer Size in byte
	
		 uint32_t RESERVED3[(0x5034-0x4C18)/4-1];
		
	__IO uint32_t FRAMEIV;					//Frame Interval, 11999 for 1ms
	
	__IO uint32_t FRAMERM;					//Frame Remaining
	
	__IO uint32_t FRAMENR;					//Frame Number
	
		 uint32_t RESERVED4[(0x5054-0x503C)/4-1];
		 
	__IO uint32_t PORTSR;					//Port Status
	
		 uint32_t RESERVED5[(0x5090-0x5054)/4-1];
		 
	__IO uint32_t TOKEN;
	
	__IO uint32_t OTGCSR;					//OTG Control and Status
} USBH_TypeDef;


#define USBH_IF_RXSTAT_Pos			0		//receive a status write form device
#define USBH_IF_RXSTAT_Msk			(0x01 << USBH_IF_RXSTAT_Pos)
#define USBH_IF_ABVTHR_Pos			1		//RX FIFO Above Threshold
#define USBH_IF_ABVTHR_Msk			(0x01 << USBH_IF_ABVTHR_Pos)
#define USBH_IF_BLWTHR_Pos			2		//TX FIFO Below Threshold
#define USBH_IF_BLWTHR_Msk			(0x01 << USBH_IF_BLWTHR_Pos)
#define USBH_IF_SOF_Pos				3		//SOF sent
#define USBH_IF_SOF_Msk				(0x01 << USBH_IF_SOF_Pos)
#define USBH_IF_PORT_Pos			8		//Port status changed
#define USBH_IF_PORT_Msk			(0x01 << USBH_IF_PORT_Pos)
#define USBH_IF_OTG_Pos				9		//SRP or HNP
#define USBH_IF_OTG_Msk				(0x01 << USBH_IF_OTG_Pos)

#define USBH_IE_RXSTAT_Pos			0
#define USBH_IE_RXSTAT_Msk			(0x01 << USBH_IE_RXSTAT_Pos)
#define USBH_IE_ABVTHR_Pos			1
#define USBH_IE_ABVTHR_Msk			(0x01 << USBH_IE_ABVTHR_Pos)
#define USBH_IE_BLWTHR_Pos			2
#define USBH_IE_BLWTHR_Msk			(0x01 << USBH_IE_BLWTHR_Pos)
#define USBH_IE_SOF_Pos				3
#define USBH_IE_SOF_Msk				(0x01 << USBH_IE_SOF_Pos)
#define USBH_IE_PORT_Pos			8
#define USBH_IE_PORT_Msk			(0x01 << USBH_IE_PORT_Pos)
#define USBH_IE_OTG_Pos				9
#define USBH_IE_OTG_Msk				(0x01 << USBH_IE_OTG_Pos)

#define USBH_SR_RESP_Pos			0		//Response Code
#define USBH_SR_RESP_Msk			(0x0F << USBH_SR_RESP_Pos)
#define USBH_SR_TRSZ_Pos			4		//Transfer Size in previous transaction
#define USBH_SR_TRSZ_Msk			(0x3FF<< USBH_SR_TRSZ_Pos)

#define USBH_CR_FLUSHFF_Pos			0		//Flush FIFO
#define USBH_CR_FLUSHFF_Msk			(0x01 << USBH_CR_FLUSHFF_Pos)

#define USBH_FFSZ_RX_Pos			0		//RX FIFO Size in word
#define USBH_FFSZ_RX_Msk			(0x3FF<< USBH_FFSZ_RX_Pos)
#define USBH_FFSZ_TX_Pos			16		//TX FIFO Size in word
#define USBH_FFSZ_TX_Msk			(0x3FF<< USBH_FFSZ_TX_Pos)

#define USBH_FFTHR_TX_Pos			0		//TX FIFO Threshold in word
#define USBH_FFTHR_TX_Msk			(0x3FF<< USBH_FFTHR_TX_Pos)
#define USBH_FFTHR_RX_Pos			16		//RX FIFO Threshold in word
#define USBH_FFTHR_RX_Msk			(0x3FF<< USBH_FFTHR_RX_Pos)

#define USBH_PORTSR_CONN_Pos		0		//Read:  1 Device connected    0 Device not connected
#define USBH_PORTSR_CONN_Msk		(0x01 << USBH_PORTSR_CONN_Pos)
#define USBH_PORTSR_CLRENA_Pos		0		//Write: Clear Port Enable, 写1清除PORTSR.ENA
#define USBH_PORTSR_CLRENA_Msk		(0x01 << USBH_PORTSR_CLRENA_Pos)
#define USBH_PORTSR_ENA_Pos			1		//1 Port enabled    0 Port disabled
#define USBH_PORTSR_ENA_Msk			(0x01 << USBH_PORTSR_ENA_Pos)
#define USBH_PORTSR_SUSP_Pos		2		//1 Port is suspended   0 Port is not suspended
#define USBH_PORTSR_SUSP_Msk		(0x01 << USBH_PORTSR_SUSP_Pos)
#define USBH_PORTSR_CLRSUSP_Pos		3		//Write: Clear Suspend Status, 写1清除PORTSR.SUSP，Initiate Resume
#define USBH_PORTSR_CLRSUSP_Msk		(0x01 << USBH_PORTSR_CLRSUSP_Pos)
#define USBH_PORTSR_RESET_Pos		4		//1 Port Reset signalling active   0 Port Reset signalling not active
#define USBH_PORTSR_RESET_Msk		(0x01 << USBH_PORTSR_RESET_Pos)
#define USBH_PORTSR_POWER_Pos		8		//1 Port power on   0 Port power off
#define USBH_PORTSR_POWER_Msk		(0x01 << USBH_PORTSR_POWER_Pos)
#define USBH_PORTSR_SPEED_Pos		9		//Read:  1 Low-Speed device attached   0 Full-Speed device attached
#define USBH_PORTSR_SPEED_Msk		(0x01 << USBH_PORTSR_SPEED_Pos)
#define USBH_PORTSR_CLRPOWER_Pos	9		//Write: Clear Port Power status, 写1清除PORTSR.POWER
#define USBH_PORTSR_CLRPOWER_Msk	(0x01 << USBH_PORTSR_CLRPOWER_Pos)
#define USBH_PORTSR_CONNCHG_Pos		16		//1 PORTSR.CONN changed，写1清零
#define USBH_PORTSR_CONNCHG_Msk		(0x01 << USBH_PORTSR_CONNCHG_Pos)
#define USBH_PORTSR_ENACHG_Pos		17		//1 PORTSR.ENA changed，写1清零
#define USBH_PORTSR_ENACHG_Msk		(0x01 << USBH_PORTSR_ENACHG_Pos)
#define USBH_PORTSR_SUSPCHG_Pos		18		//set when a full Resume sequence is finished，写1清零
#define USBH_PORTSR_SUSPCHG_Msk		(0x01 << USBH_PORTSR_SUSPCHG_Pos)
#define USBH_PORTSR_RSTCHG_Pos		20		//set at the end of the Port Reset signal，写1清零
#define USBH_PORTSR_RSTCHG_Msk		(0x01 << USBH_PORTSR_RSTCHG_Pos)

#define USBH_TOKEN_ADDR_Pos			0
#define USBH_TOKEN_ADDR_Msk			(0x7F << USBH_TOKEN_ADDR_Pos)
#define USBH_TOKEN_EPNR_Pos			7		//Endport Number
#define USBH_TOKEN_EPNR_Msk			(0x0F << USBH_TOKEN_EPNR_Pos)
#define USBH_TOKEN_DATAX_Pos		11		//0 DATA0   1 DATA1
#define USBH_TOKEN_DATAX_Msk		(0x01 << USBH_TOKEN_DATAX_Pos)
#define USBH_TOKEN_TYPE_Pos			13		//13 SETUP   1 OUT   9 IN
#define USBH_TOKEN_TYPE_Msk			(0x0F << USBH_TOKEN_TYPE_Pos)
#define USBH_TOKEN_ISO_Pos			17		//1 ISO transfer   0 Non-ISO transfer
#define USBH_TOKEN_ISO_Msk			(0x01 << USBH_TOKEN_ISO_Pos)
#define USBH_TOKEN_SPEED_Pos		18		//2 LS   3 FS
#define USBH_TOKEN_SPEED_Msk		(0x03 << USBH_TOKEN_SPEED_Pos)
#define USBH_TOKEN_TRSZ_Pos			20		//Transfer Size in byte
#define USBH_TOKEN_TRSZ_Msk			(0x3FF<< USBH_TOKEN_TRSZ_Pos)

#define USBH_OTGCSR_SRSUCC_Pos		0		//Session Request Success
#define USBH_OTGCSR_SRSUCC_Msk		(0x01 << USBH_OTGCSR_SRSUCC_Pos)
#define USBH_OTGCSR_SRSCHG_Pos		1		//Session Request Status Change,  set to 1 on Session Request Success, 写1清零
#define USBH_OTGCSR_SRSCHG_Msk		(0x01 << USBH_OTGCSR_SRSCHG_Pos)
#define USBH_OTGCSR_HNSUCC_Pos		2		//Host Negotiation Success
#define USBH_OTGCSR_HNSUCC_Msk		(0x01 << USBH_OTGCSR_HNSUCC_Pos)
#define USBH_OTGCSR_HNSCHG_Pos		3		//Host Negotiation Status Change, set to 1 on Host Negotiation Success，写1清零
#define USBH_OTGCSR_HNSCHG_Msk		(0x01 << USBH_OTGCSR_HNSCHG_Pos)
#define USBH_OTGCSR_SRDET_Pos		4		//Session Request Detected
#define USBH_OTGCSR_SRDET_Msk		(0x01 << USBH_OTGCSR_SRDET_Pos)
#define USBH_OTGCSR_SRDCHG_Pos		5		//Session Request Detected Change, set to 1 when a Session Request is detected，写1清零
#define USBH_OTGCSR_SRDCHG_Msk		(0x01 << USBH_OTGCSR_SRDCHG_Pos)
#define USBH_OTGCSR_HNDET_Pos		6		//Host Negotiation Detected
#define USBH_OTGCSR_HNDET_Msk		(0x01 << USBH_OTGCSR_HNDET_Pos)
#define USBH_OTGCSR_HNDCHG_Pos		7		//Host Negotiation Detect Change, set to 1 when a Host Negotiation is detected, 写1清零
#define USBH_OTGCSR_HNDCHG_Msk		(0x01 << USBH_OTGCSR_HNDCHG_Pos)
#define USBH_OTGCSR_ID_Pos			8		//Connector ID Status, 0 in A-device mode,   1 in B-device mode
#define USBH_OTGCSR_ID_Msk			(0x01 << USBH_OTGCSR_ID_Pos)
#define USBH_OTGCSR_IDCHG_Pos		9		//set when OTGCSR.ID changed, 写1清零
#define USBH_OTGCSR_IDCHG_Msk		(0x01 << USBH_OTGCSR_IDCHG_Pos)
#define USBH_OTGCSR_MODE_Pos		10		//0 Host mode   1 Device mode
#define USBH_OTGCSR_MODE_Msk		(0x01 << USBH_OTGCSR_MODE_Pos)
#define USBH_OTGCSR_SRPREQ_Pos		16		//SRP Request
#define USBH_OTGCSR_SRPREQ_Msk		(0x01 << USBH_OTGCSR_SRPREQ_Pos)
#define USBH_OTGCSR_HNPREQ_Pos		17		//HNP Request
#define USBH_OTGCSR_HNPREQ_Msk		(0x01 << USBH_OTGCSR_HNPREQ_Pos)
#define USBH_OTGCSR_HHNPENA_Pos		18		//Host HNP Enable, set by app when Set Feature Set HNP Enable is successful on connected device
#define USBH_OTGCSR_HHNPENA_Msk		(0x01 << USBH_OTGCSR_HHNPENA_Pos)
#define USBH_OTGCSR_HNPENA_Pos		19		//set by app when receives Set Feature Set HNP Enable command
#define USBH_OTGCSR_HNPENA_Msk		(0x01 << USBH_OTGCSR_HNPENA_Pos)
#define USBH_OTGCSR_SRPCAP_Pos		20		//SRP Capable
#define USBH_OTGCSR_SRPCAP_Msk		(0x01 << USBH_OTGCSR_SRPCAP_Pos)
#define USBH_OTGCSR_HNPCAP_Pos		21		//HNP Capable
#define USBH_OTGCSR_HNPCAP_Msk		(0x01 << USBH_OTGCSR_HNPCAP_Pos)




