Synwit-Co-Ltd/SWM342_Lib/SWM342_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM342.h
#define I2C0				((I2C_TypeDef  *) I2C0_BASE)
#define I2C1				((I2C_TypeDef  *) I2C1_BASE)

#define ADC0 				((ADC_TypeDef  *) ADC0_BASE)
#define ADC1 				((ADC_TypeDef  *) ADC1_BASE)

#define PWM0				((PWM_TypeDef  *) PWM0_BASE)
#define PWM1				((PWM_TypeDef  *) PWM1_BASE)
#define PWMG				((PWMG_TypeDef *) PWMG_BASE)

#define CAN0 				((CANFD_TypeDef*) CAN0_BASE)
#define CAN1				((CAN_TypeDef  *) CAN1_BASE)

#define USBD				((USBD_TypeDef *) USBD_BASE)
#define USBH				((USBH_TypeDef *) USBH_BASE)

#define SDIO				((SDIO_TypeDef *) SDIO_BASE)

#define DCMI				((DCMI_TypeDef *) DCMI_BASE)

#define SDRAMC				((SDRAMC_TypeDef*)SDRAMC_BASE)

#define DMA 				((DMA_TypeDef  *) DMA_BASE)

#define LCD					((LCD_TypeDef  *) LCD_BASE)

#define DMA2D				((DMA2D_TypeDef*) DMA2D_BASE)

#define SRA					((SRA_TypeDef  *) SRA_BASE)

#define DAC					((DAC_TypeDef  *) DAC_BASE)

#define CRC					((CRC_TypeDef  *) CRC_BASE)

#define CORDIC				((CORDIC_TypeDef*)CORDIC_BASE)

#define DIV					((DIV_TypeDef  *) DIV_BASE)

#define RTC					((RTC_TypeDef  *) RTC_BASE)

#define WDT					((WDT_TypeDef  *) WDT_BASE)

#define QEI					((QEI_TypeDef  *) QEI_BASE)

#define FMC					((FMC_TypeDef  *) FMC_BASE)

#define SFC					((SFC_TypeDef  *) SFC_BASE)

#define CACHEC				((CACHEC_TypeDef*)CACHEC_BASE)

#define JPEG				((JPEG_TypeDef *) JPEG_BASE)



#include "SWM342_port.h"
#include "SWM342_gpio.h"
#include "SWM342_exti.h"
#include "SWM342_timr.h"
#include "SWM342_uart.h"
#include "SWM342_spi.h"
#include "SWM342_i2c.h"
#include "SWM342_adc.h"
#include "SWM342_pwm.h"
#include "SWM342_dma.h"
#include "SWM342_can.h"
#include "SWM342_canfd.h"
#include "SWM342_sdio.h"
#include "SWM342_sdram.h"
#include "SWM342_flash.h"
#include "SWM342_lcd.h"
#include "SWM342_sfc.h"
#include "SWM342_dac.h"
#include "SWM342_cordic.h"
#include "SWM342_crc.h"
#include "SWM342_div.h"
#include "SWM342_rtc.h"
#include "SWM342_wdt.h"
#include "SWM342_qei.h"
#include "SWM342_usb.h"
#include "SWM342_usbd.h"
#include "SWM342_usbh.h"
#include "SWM342_jpeg.h"
#include "SWM342_dcmi.h"
#include "SWM342_dma2d.h"
#include "SWM342_sra.h"
#include "SWM342_cache.h"
#include "SWM342_iofilt.h"


#ifdef  SW_LOG_RTT
#define log_printf(...)	 	SEGGER_RTT_printf(0, __VA_ARGS__)
#else
#define log_printf(...)	 	printf(__VA_ARGS__)
#endif


#ifndef SW_LOG_LEVEL
#define SW_LOG_LEVEL        0
#endif

#if (SW_LOG_LEVEL > 0)
#define SW_LOG_ERR(...)    	{						 \
							log_printf("ERROR: ");   \
							log_printf(__VA_ARGS__); \
							log_printf("\n");		 \
							}

#if (SW_LOG_LEVEL > 1)
#define SW_LOG_WARN(...) 	{						 \
							log_printf("WARN : ");   \
							log_printf(__VA_ARGS__); \
							log_printf("\n");		 \
							}

#if (SW_LOG_LEVEL > 2)
#define SW_LOG_INFO(...)   	{						 \
							log_printf("INFO : ");   \
							log_printf(__VA_ARGS__); \
							log_printf("\n");		 \
							}
#else
#define SW_LOG_INFO(...)
#endif

#else
#define SW_LOG_WARN(...)
#define SW_LOG_INFO(...)
#endif

#else
#define SW_LOG_ERR(...)
#define SW_LOG_WARN(...)
#define SW_LOG_INFO(...)
#endif


#endif //__SWM342_H__
